{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "fall",
      "patterns": [
        "When will AU offer Admission in Fall",
        "When is fall Admission Scheduled ?",
        "When will fall admission get started ?",
        "Tell me about fall admission?"

      ],
      "responses": [
        "January",
        "AU offers fall Admission in January",
        "Fall Admission will be in January",
        "January is scheduled time for fall admission"
      ]
    },
    {
      "tag": "spring",
      "patterns": [
        "When will AU offer Admission in Spring?",
        "When is Spring Admission Scheduled",
        "When will Spring admission get started?",
        "Tell me about spring admission?"
      ],
      "responses": [
        "June-July",
        "Spring Admission will be in June-July",
        "AU offers spring Admission in June-July"
      ]
    },
    {
      "tag": "Merit",
      "patterns": [
        "Can you please explain the Merit Scholarship ?",
        "Please tell about merit scholarship?",
        "Does AU offers merit scholarship?"
      ],
      "responses": [
        "Through this scheme, AU grants admission to talented students at the undergraduate level who have secured ≥90% marks in Intermediate/Eqv from any education board/system by waiving of 100% tuition fee on successful completion of the first semester.",
        "Yes, AU offers merit scholarship.Through this scheme, AU grants admission to talented students at the undergraduate level who have secured ≥90% marks in Intermediate/Eqv from any education board/system by waiving of 100% tuition fee on successful completion of the first semester."
      ]
    },
    {
      "tag": "financial",
      "patterns": [
        "Can you please explain about Financial Scholarship ?",
        "Please tell about financial scholarship?",
        "Does AU offers financial scholarship?"
      ],
      "responses": [
        "Through this scheme AU funds in each semester to needy students who face the financial constraints ranging from 25 to 50% of tuition fee discount.",
        "Yes, AU offers financial scholarship.Through this scheme AU funds in each semester to needy students who face the financial constraints ranging from 25 to 50% of tuition fee discount."
      ]
    },
    {
      "tag": "employee",
      "patterns": [
        "Is there any fee concession for Air Force employee's children?",
        "Does AU offers fee concession to air force employee's children?",
        "any fee concession for air force employee's children?"
      ],
      "responses": [
        "AU grants 25% tuition fee discount to PAF Wards and 50% discount to AU Employees and their wards",
        "Yes, AU grants 25% tuition fee discount to PAF Wards and 50% discount to AU Employees and their wards"
      ]
    },
    {
      "tag": "reimbursement",
      "patterns": [
        "What is PM tuition fee reimbursement scheme?",
        "Explain about PM tuition fee reimbursement scheme?"
      ],
      "responses": [
        "Through this scheme students hailing from the less developed areas of Pakistan (Selected areas) can avail the funding opportunities at Graduate and Postgraduate level",
        "Students hailing from the less developed areas of Pakistan (Selected areas) can avail the funding opportunities at Graduate and Postgraduate level"
      ]
    },
    {
      "tag": "SAT",
      "patterns": [
        "What should be the minimum SAT and NAT score for BBA ?",
        "What is the minimum SAT and NAT score for BBA ?",
        "What is SAT and NAT score for BBA?"
      ],
      "responses": [
        "At least 1100 in SAT I or At least 50 in NAT",
        "Minimum 1100 in SAT I or At least 50 in NAT"
      ]
    },
    {
      "tag": "GAT",
      "patterns": [
        "What should be the minimum GAT score for Phd entry test?",
        "What is the minimum GAT score for Phd entry test? ",
        "GAT score for Phd entry test? "
      ],
      "responses": [
        "GAT-Subject Test (at least 60% score)",
        "Atleast 60%",
        "Minimum 60%"
      ]
    },
    {
      "tag": "engineering",
      "patterns": [
        "What is the score division for entry test in engineering program?",
        "Discuss the score division for entry test in engineering program?"
        
      ],
      "responses": [
        "English(20%) ,  Math (45%) , Physics (35%)  =   Total (100%)",
        "Score divison is English(20%) ,  Math (45%) , Physics (35%)  =   Total (100%)"
      ]
    },
    {
      "tag": "biomedical",
      "patterns": [
        "What is the score division for entry test in Biomedical program?",
        "score division for entry test in biomedical engineering"
      ],
      "responses": [
        "Physics(25%)  , Chemistry(20%)  , English(15%)  ,  General Knowledge (Math’s)(25%)  ,  General Knowledge (Biology)(15%)   =   Total(100%)",
        "Score Division is Physics(25%)  , Chemistry(20%)  , English(15%)  ,  General Knowledge (Math’s)(25%)  ,  General Knowledge (Biology)(15%)   =   Total(100%)"
      ]
    },
    {
      "tag": "Computer",
      "patterns": [
        "What is the score division for entry test in Computer Science program? ",
        "Score division for entry test in Computer Science program? "
        
      ],
      "responses": [
        "English (25%)  , Math (55%)  , Physics (20%)   =   Total (100%)",
        "Score Division is English (25%)  , Math (55%)  , Physics (20%)   =   Total (100%)"
      ]
    },
    {
      "tag": "merit score",
      "patterns": [
        "How to Calculate the merit score?",
        "way to calculate merit score"
      ],
      "responses": [
        "SSC (15%) + HSSC (25%) + Entrance Test (60%) =100%",
        "You can calculate merit score by SSC (15%) + HSSC (25%) + Entrance Test (60%) =100%"
      ]
    },
    {
      "tag": "transfer",
      "patterns": [
        "Is Student is allowed to transfer to AU from Another university?",
        "Does AU offer tranfer from other university?"
      ],
      "responses": [
        "Yes, Students are allowed to transfer but The transfer student must complete at least 50 percent of the required credit hours at AU to earn the degree. Courses with grade less than B minus cannot be transferred and will need to be retaken at AU. "
      ]
    },
    {
      "tag": "late admission",
      "patterns": [
        "Is there any relaxation in late admission?",
        "what is the procedure of late admission?",
        "Does AU facilitates late admission?"
      ],
      "responses": [
        "As a matter of policy, no deviation is made from the published schedule and late admissions are not entertained.The University reserves the right to reject the application for admission of a student without assigning a reason.",
        "No, AU doesn't entertain late admission."
      ]
    },
    {
      "tag": "PEEF",
      "patterns": [
        "Explain about Punjab Education Endowment Fund Scheme (PEEF) Scholarship.",
        "what is peef scholarship?"
      
      ],
      "responses": [
        "This scheme offers AU students to avail 50% of Tuition Fee discount in each semester through PEEF as per the laid down criteria set by the Punjab Govt to sponsor the higher education of deserving students"
      ]
    },
     {
      "tag": "job",
      "patterns": [
        "Does AU provide jobs to students pursuing MS and Phd degree at AU? ",
        "Job for MS or PhD students?"
      ],
      "responses": [
        "Career progression through Lab Engineer, Teaching/ Research Assistant, Post-doc and faculty positions at Air University.",
        "Yes, AU offers Career progression through Lab Engineer, Teaching/ Research Assistant, Post-doc and faculty positions at Air University."
      ]
    },
     {
      "tag": "scholarship phd",
      "patterns": [
        "Is there any Scholarship for students pursing Phd and MS in AU?",
        "Does AU offers scholarship to phd students?",
        "any scholarship for MS or PhD students?"
      ],
      "responses": [
        "A stipend of Rs. 40,000/- per month",
        "Yes, AU grants a stipend of Rs. 40,000/- per month"
      ]
    },
     {
      "tag": "library",
      "patterns": [
        "Is library facility available to students ?",
        "Does AU has library?",
        "Does Air university provides library facility??"
      ],
      "responses": [
        "Yes, there is a library located in AU",
        "Yes, AU provides library facility to the students"
      ]
    },
     {
      "tag": "library membership",
      "patterns": [
        "Is there any membership for library ?",
        "library's membership?",
        "Does AU provides library's membership?"
      ],
      "responses": [
        "Yes, the library offers paid membership to PAF personnel, academicians and research scholars."
      ]
    },
     {
      "tag": "discussion room",
      "patterns": [
        "Is there any discussion room in library ?",
        "Does AU provides discussion room facility?",
        "Discussion room ?"
      ],
      "responses": [
        "Yes, There are 06 discussion rooms for group study and 56 fully equipped study carrels."
      ]
    },
     {
      "tag": "computer library",
      "patterns": [
        "Is there computer facility available in library ?",
        "computers in library?"
      ],
      "responses": [
        "Yes, there are 70 computers in library."
      ]
    },
     {
      "tag": "societies",
      "patterns": [
        "How many societies and clubs are in AU? ",
        "clubs in AU ?",
        "Is there any student societies in Air university?"
      ],
      "responses": [
        "There are 19 different societies in AU.",
        "Yes, There are 19 different societies in AU."
      ]
    },
     {
      "tag": "faculty",
      "patterns": [
        "How many faculty members are in AU ?"
      ],
      "responses": [
        "There are more than 350 faculty members in AU."
      ]
    },
     {
      "tag": "degree programs",
      "patterns": [
        "How many degree programs are in AU?",
        "How many degree programs does AU offers?"
      ],
      "responses": [
        "There are 61 degree programs in AU.",
        "AU offers 61 degree programs"
      ]
    },
     {
      "tag": "CS",
      "patterns": [
        "What programs are being offered by faculty of computer science?",
        "What programs are being offered by faculty of CS?",
        "Programs by CS?"
      ],
      "responses": [
        "The programs offered are: Software Engineering, Computer Science, Artificial Intelligence, Games and Technologies, Cyber Security.",
        "Faculty of CS offers Software Engineering, Computer Science, Artificial Intelligence, Games and Technologies, Cyber Security."
      ]
    },
     {
      "tag": "engineering programs",
      "patterns": [
        "How many engineering programs are offered by AU ?",
        "engineering programs"
      ],
      "responses": [
        "Electrical Engineering, Computer Engineering, Mechanical Engineering, Electrical Engineering",
        "AU offers following Engineering programs: Electrical Engineering, Computer Engineering, Mechanical Engineering, Electrical Engineering"
      ]
    },
      {
      "tag": "avionics",
      "patterns": [
        "What programs are being offered by Faculty of Avionics?",
        "Avionics programs"
      ],
      "responses": [
        "The institute offers nine degree programs which include Bachelor of Mechanical Engineering, Master of Mechanical Engineering (with specializations in Design Engineering, and Fluid Power Engineering), Master of Aerospace Engineering (with specializations in Solid Mechanics, Fluid Dynamics, Vehicle Design, Propulsion, Flight Dynamics and Control, and Astronautics and Space Engineering) Ph.D. in Mechanical Engineering, and Ph.D. in Aerospace Engineering",
        "Avionics department offers nine degree programs which include Bachelor of Mechanical Engineering, Master of Mechanical Engineering (with specializations in Design Engineering, and Fluid Power Engineering), Master of Aerospace Engineering (with specializations in Solid Mechanics, Fluid Dynamics, Vehicle Design, Propulsion, Flight Dynamics and Control, and Astronautics and Space Engineering) Ph.D. in Mechanical Engineering, and Ph.D. in Aerospace Engineering"
      ]
    },
      {
      "tag": "AUSOM",
      "patterns": [
        "What programs are being offered by AU school of management?",
        "programs by AUSOM?"
      ],
      "responses": [
        "BBA-Hons, BS-Accounting and Finance, MBA, MS Project Management, MS-Management/HR/Finance and PhD Management Sciences",
        "AUSOM ofers BBA-Hons, BS-Accounting and Finance, MBA, MS Project Management, MS-Management/HR/Finance and PhD Management Sciences"
      ]
    },
      {
      "tag": "applied sciences",
      "patterns": [
        "What programs are being offered by faculty of basic and applied sciences?"
      ],
      "responses": [
        "Physics and Mathematics",
        "Applied Sciences offers Physics and Mathematics"
      ]
    },
      {
      "tag": "MS English",
      "patterns": [
        "Is there MS English program in AU?",
        "MS English?"
      ],
      "responses": [
        "Yes, AU offers MS. English"
      ]
    },
      {
      "tag": "Psychology",
      "patterns": [
        "Is there Psychology program available in AU?",
        "psychology programs?"
      ],
      "responses": [
        "Yes, AU offers Psychology programs."
      ]
    },
      {
      "tag": "student portal",
      "patterns": [
        "How can I access my Students portal after Admission?",
        "how to access student portal?",
        "student portal?"
      ],
      "responses": [
        "You can log in to the student portal by entering the ID assigned to you by university and password is your CNIC numbers with dashes."
      ]
    },
      {
      "tag": "LMS",
      "patterns": [
        "How to use AU LMS ?",
        "LMS?",
        "learning managenemt system?"
      ],
      "responses": [
        "Enter your email id and password to gain access to the LMS."
      ]
    },
      {
      "tag": "challan form",
      "patterns": [
        "How to submit the admission challan form?",
        "ewhat is the procedure of submitting challan form?"
      ],
      "responses": [
        "Application Challan Form for Online admission can be submitted or sent through mail so as to reach no later than the last date for submission of application forms at the main campus of AU.",
        "Submit it through mail or at AU main campus"
      ]
    },
      {
      "tag": "address",
      "patterns": [
        "What is the address of AU main campus?",
        "AU main campus?"
      ],
      "responses": [
        "Air University, PAF Complex, Sector E-9, Islamabad.",
        "The address of main campus is: Air University, PAF Complex, Sector E-9, Islamabad."
      ]
    },
      {
      "tag": "documents bachelor",
      "patterns": [
        "What are the required documents for Bachelor's program?",
        "What are the required documents for BS program?",
        "required documents for bachelor's program?"
      ],
      "responses": [
        "Attested copy of SSC Mark Sheet or its equivalent. Attested copy of HSSC Mark Sheet or its equivalent. Equivalence certificate from Inter Board Chairman Committee for A level or equivalent qualification from other systems. Three fresh passport size photographs with name and admit card number on the back. Attested copy of CNIC or Form 'B'. Attested copy of domicile certificate"
        
      ]
    },
      {
      "tag": "documents masters",
      "patterns": [
        "What are the required documents for Master's program in AU?",
        "resquired documents for MS program"
 
      ],
      "responses": [
        "Attested copy of SSC Certificate/ Marks Sheet or its equivalent. Attested copy of HSSC Certificate/ Marks Sheet or its equivalent Attested copy of Marks Sheet of Bachelor's degree programme. Attested copy of Marks Sheet of Master's degree programme, if applicable. Three fresh passport size photographs with name and admit card number on back. In case of in-service students, No Objection Certificate (NOC) from the Employer is required to be attached with Application form and routed through Proper Channel or they can submit the same at the time of interview, failing which their admission shall be cancelled. Attested copy of NIC. PEC Registration Certificate is to be submitted along with the application form for MS Engineering programs. Attested copy of domicile certificate"
        
      ]
    },
      {
      "tag": "phd document",
      "patterns": [
        "What are the required documents for PhD program in AU?",
        "erequired documents for phd?"
      ],
      "responses": [
        "Attested copy of SSC Certificate/ Marks Sheet or its equivalent. Attested copy of HSSC Certificate/ Marks Sheet or its equivalent. Attested copy of Marks Sheet of Bachelor's degree programme. Attested copy of Marks Sheet of Master's degree programme, if applicable. Equivalence Certificate from HEC in case of foreign degree. Three fresh passport size photographs with name and admit card number on back. GAT Subject Test (at least 60% score cumulative) or GRE Subject Test(atleast 60th Percentile) Certificate required. Attested copy of NIC. Attested copy of domicile certificate. Candidates are required to provide a copy of synopsis/research proposal. Admission is subject to the availability of the Supervisor in the field of research and fulfillment of HEC’s criteria. In case of in-service students, No Objection Certificate (NOC) from the Employer is required to be attached with Application form and routed through Proper Channel or they can submit the same at the time of interview, failing which their admision shall be cancelled. Every student at the time of admission to this University shall give an undertaking to the effect that he/she is not pursuing degree program in any other institution."
        
      ]
    },
      {
      "tag": "Admission",
      "patterns": [
        "How to apply for Admission in AU?",
        "Admission in AU?"
      ],
      "responses": [
        "Click on the Following Link:    https://www.au.edu.pk/Pages/Admission/how_to_apply.aspx"
      ]
    },
      {
      "tag": "VC",
      "patterns": [
        "Who is the VC of AU?",
        "Vice Chancellor of AU?"
      ],
      "responses": [
        "AIR MARSHAL JAVAID AHMED HI(M) (Retd)"
      ]
    },
      {
      "tag": "strength",
      "patterns": [
        "What is the strength of students in the campus?",
        "strength of students"
      ],
      "responses": [
        "3000+",
        "There are 3000+ students"
      ]
    },
      {
      "tag": "medical facility",
      "patterns": [
        "Is there medical facility available on campus?",
        "medical facility",
        "Tell about medical facility in AU campus"
      ],
      "responses": [
        "Yes, we have a well-equipped medical care unit and an isolation ward.",
        "we have a well-equipped medical care unit and an isolation ward"
      ]
    },
    {
      "tag": "co-curicular",
      "patterns": [
        "What co-curricular activities are conducted on the campus?",
        "co-curicular activities",
        "coculicular activities",
        "Is there any co curicular activities in AU?",
        "co curicular"
      ],
      "responses": [
        "Various co-curricular activities like sports (which include both indoor and outdoor games), cultural meets, fests and competitions are held from time to time.",
        "AU offers Various co-curricular activities like sports (which include both indoor and outdoor games), cultural meets, fests and competitions are held from time to time. ",
        "Many co-curicular activities are held on campus like sports (which include both indoor and outdoor games), cultural meets, fests and competitions are held from time to time."
      ]
    },
    {
      "tag": "security",
      "patterns": [
        "What about safety of student on campus?",
        "Is AU safe for students?"
      ],
      "responses": [
        "The security of students is taken care of by Retired military personnel who provide round the clock security within the campus.",
        "AU take care of security of students by Retired military personnel who provide round the clock security within the campus."
      ]
    },
    {
      "tag": "semester",
      "patterns": [
        "Does the University follows a Semester or Annual system?",
        "Annual system or semester system"
      ],
      "responses": [
        "Here at Air University we have semester system.",
        "AU follows semester system"
      ]
    },
    {
      "tag": "uniform",
      "patterns": [
        "Does the University have uniforms?",
        "uniforms?"
      ],
      "responses": [
        "No.",
        "AU doesn't follows uniform."
     ]
    },
    {
      "tag": "sector",
      "patterns": [
        "Is the Air University a private or Public sector university?",
        "AU public sector or privarte sector?"
      ],
      "responses": [
        "Public sector.",
        "AU is public sector university"
      ]
    },
    {
      "tag": "recognition",
      "patterns": [
        "Is the AU degree recognized?",
        "Is AU programs HEC recognized?"
      ],
      "responses": [
        "The Air University has been established by the Government of Pakistan. As such, its degrees are recognized by the Higher Education Commission, Islamabad. Please visit the HEC web-site (https://www.hec.gov.pk/english/universities/pages/recognised.aspx)",
        "Yes, The Air University has been established by the Government of Pakistan. As such, its degrees are recognized by the Higher Education Commission, Islamabad. Please visit the HEC web-site (https://www.hec.gov.pk/english/universities/pages/recognised.aspx)"
      ]
    },
    {
      "tag": "International",
      "patterns": [
        "Are the courses offered by AU comparable to international standards?"
      ],
      "responses": [
        "Yes. Air University programs are based on curricula developed by the Higher Education Commission (HEC). The course outlines used in these curricula are based on international demands and standards."
      ]
    },
    {
      "tag": "concern",
      "patterns": [
        "How can I get a “To whom it may Concern” certificate?",
        "to whom it may concern certificate?"
      ],
      "responses": [
        "The office of the Registrar facilitates its students to get a certificate which shows their current status of study at AU, upon payment of prescribed fee."
        
      ]
    },
    {
      "tag": "migration certificate",
      "patterns": [
        "How can I get Migration Certificate/No Objection Certificate (NOC)?",
        "Migration certificate?",
        "No objection certificate?"
      ],
      "responses": [
        "The students of Air University can get Migration certificate/NOC within a short time upon payment of the prescribed fee."
      ]
    },
    {
      "tag": "duplicate Id",
      "patterns": [
        "How can I get a Duplicate ID card?",
        "I lost my Id card. From where I can get it?",
        "Student card",
        "I lost my student card. How can I get duplicate student card?"
      ],
      "responses": [
        "By visiting student affairs in AU campus.",
        "you can get duplicate student card by visiting student affairs in AU campus."
      ]
    },
    {
      "tag": "parking",
      "patterns": [
        "Where can I park in campus?",
        "Do we have patking facility in AU ?"
      ],
      "responses": [
        "Visit the Office of Parking and Transportation Services for information about campus parking options."
      ]
    },
    {
      "tag": "no hssc",
      "patterns": [
        "How to apply for program when the hssc certificates have not yet been received?",
        "I haven't received hssc certificate. How can I apply?",
        "No hssc certificate"
      ],
      "responses": [
        "You can submit HSSC-I marksheet and hope certificate issued by the college.",
        "You can apply by submitting HSSC-I marksheet and hope certificate issued by the college."
      ]
    },
    {
      "tag": "interview",
      "patterns": [
        "Will I be interviewed as part of the admission process?",
        "interview?"
      ],
      "responses": [
        "Some programs require an interview. If your program has the requirement you will be contacted to set up the interview after your completed application has been received. The notification may come by email so please check the email address you listed on your application."
        
      ]
    },
    {
      "tag": "calendar",
      "patterns": [
        "What kind of academic calendar does AU follows?",
        "academic calendar",
        "When does the academic year of the university begin and end ?",
        "What schedule of the academic year does the university follow ? "
      ],
      "responses": [
        "There are two main semesters: Fall and Spring. A reduced variety of courses is also offered during the summer."
      ]
    },
    {
      "tag": "ICS",
      "patterns": [
        "Can ICS student gain admission in BS Computer Science?",
        "ICS students"
      ],
      "responses": [
        "Yes, those having studied a combination of Physics, Mathematics and Computer Studies or Computer Science are eligible for admission "
        
      ]
    },
    {
      "tag": "admission fee",
      "patterns": [
        "Where should I deposit online admission fee?",
        "admission fee?"
      ],
      "responses": [
        "The online application please download Challan form that can be deposited in any branch of HBL",
        "Deposit in any branch of hbl"
      ]
    },
    {
      "tag": "working days",
      "patterns": [
        "What are the working days and time of Admission Office?",
        "working days"
      ],
      "responses": [
        "Mon-Fri (8:00am to 4:00 pm)"
      ]
    },
    {
      "tag": "No NTS Test",
      "patterns": [
        "Can we get admission without NTS test?",
        "NTS Test"
      ],
      "responses": [
        "University conducts its own admission test & interview. You can certainly apply for admissions since NTS is not mandatory for the admissions."
       
      ]
    },
    {
      "tag": "awaiting",
      "patterns": [
        "My result is awaited? can I still apply?"
      ],
      "responses": [
        "Yes, you can apply however you are required to submit hope certificate, duly attested by your institute’s higher authority stating the minimum percentage required for the applied program."
        
      ]
    },
    {
      "tag": "transport",
      "patterns": [
        "Does university has Transport facility?",
        "transport facility"
      ],
      "responses": [
        "Yes. University has Transport facility on assigned routes."
      ]
    },
    {
      "tag": "negative marking",
      "patterns": [
        "Is there negative marking in entrance test?",
        "negative marking?",
        "What is the information regarding negative marking ?",
        "What are the details about the negative marking ?",
        "What are the updates in regards to the negative marking system ?",
        "Is there any information available about the negative marking ?",
        "How will the negative marking take place ?"
      ],
      "responses": [
        "There is no negative marking in entrance test."
      ]
    },
    {
      "tag": "another city",
      "patterns": [
        "Do I have option to give entry test from another city?",
        "test from another city?"
      ],
      "responses": [
        "Unfortunately not. You have to appear at the venue announced."
      ]
    },
    {
      "tag": "multiple programs",
      "patterns": [
        "Can I apply for multiple program?",
        "multiply programs?"
      ],
      "responses": [
        "Yes, you can apply for multiple programs. The admission form contains list of all the available programs. You can choose up to 4 preferences while selecting the programs at the max; in case you would not get admission in the 1st priority program, then your application will be automatically routed to the 2nd opted program or you can change your priority any time by contacting the admission office."
        
      ]
    },
    {
      "tag": "A levels",
      "patterns": [
        "Can I apply on basis of A Levels or O levels?",
        "A levels?",
        "O levels",
        "Can I apply on basis of A Levels?",
        "Can I apply on basis of O Levels?"
      ],
      "responses": [
        "Submission of only O&A level grade / mark sheets will not serve the purpose. Equivalence certificates duly issued by IBCC, Pakistan are necessary for those candidates who do not possess Matric &FSc / FA qualifications."
       
      ]
    },
    {
      "tag": "campuses",
      "patterns": [
        "How many campuses does the university have?",
        "campuses of AU?"
      ],
      "responses": [
        "There are 3 campuses. AU Campus Islamabad, AU campus Multan, AU campus Risalpur"
      ]
    },
    {
      "tag": "evening",
      "patterns": [
        "Are there any evening Programs at AU?",
        "evening programs",
        "I need information regarding the evening classes.",
        "What are the details about the classes held in the evening?",
        "What are the updates on the classes that are held in the evening ?",
        "Has any information been provided about the evening classes ?", 
        "evening classes"
      
      ],
      "responses": [
        "Many Masters Programs and PhD at AU are scheduled in the Evening.",
        "There are evening classes for PhD and MS programs."
      ]
    },
    {
      "tag": "masters awaiting",
      "patterns": [
        "Can I apply for Masters admission if my result is awaited?",
        "Can I apply for MS admission if my result is awaited?"
      ],
      "responses": [
        "You can apply for Masters admission provided you are able to submit your complete final result before commencement of classes."
      ]
    },
    {
      "tag": "MBA without experience",
      "patterns": [
        "Can I apply for MBA (2 years) if I have no experience?",
        "MBA without experience?"
      ],
      "responses": [
        "Yes, you can apply for MBA (2 years), however, candidates having experience will be given preference in admission."
      ]
    },
    {
      "tag": "PEC",
      "patterns": [
        "Can a candidate whose Bachelor degree is not accredited by Pakistan Engineering Council (PEC) apply for Masters admission?"
      ],
      "responses": [
        "Bachelor of engineering degree must be accredited by PEC to be eligible for MS Engineering programs at AU. However one can apply for non engineering degree programs."
        
      ]
    },
    {
      "tag": "discipline",
      "patterns": [
        "Can I change my discipline to a discipline which I have not mentioned in the admission application form?",
        "Can I change my program?",
        "I filled the wrong category, can I change it now?"
      ],
      "responses": [
        "You are not allowed to change the discipline in which you have not applied or selected at the time of admission."
      ]
    },
    {
      "tag": "expatriate",
      "patterns": [
        "I am a born Pakistani with a foreign passport, can I apply as an expatriate student?",
        "foreign passport?",
        "foreign student"
      ],
      "responses": [
        "An expatriate having single foreign nationality cannot apply for admission as expatriate. However you can apply as international candidate."
      ]
    },
    {
      "tag": "apply after due date",
      "patterns": [
        "Can I apply for admission after due date of submission of admission form?"
      ],
      "responses": [
        "You are not allowed to apply for admission after due date."
      ]
    },
    {
      "tag": "list",
      "patterns": [
        "How I can I check my name/status in MS admission at AU?",
        "list of MS?"
      ],
      "responses": [
        "Admission selection list once generated are uploaded on AU website. Moreover SMS is also forwarded to the selected candidate on the mobile number given in the application form by candidate."

      ]
    },
    {
      "tag": "recieved documents",
      "patterns": [
        "How candidate will be informed whether AU has received his/her documents?"
      ],
      "responses": [
        "Documents received will be confirmed through email to the candidate.​"
      ]
    },
    {
      "tag": "interview date",
      "patterns": [
        "Can I change my interview date?"
      ],
      "responses": [
        "You are not allowed to change the interview date."
      ]
    },
    {
      "tag": "missed interview",
      "patterns": [
        "Is there any provision of interview if I miss one?",
        "I missed my interview"
      ],
      "responses": [
        "You are not allowed to reappear for interview."
      ]
    },
    {
      "tag": "visit",
      "patterns": [
        "Can I visit university?"
      ],
      "responses": [
        "Yes you are allowed to visit during campus timings."
      ]
    },
    {
      "tag": "admission criteria",
      "patterns": [
        "Can I apply if I don’t meet the admissions criteria?"
      ],
      "responses": [
        "Those students who do not exactly meet our admissions criteria can contact the Office of Admission. Such cases are reviewed on case by case basis."
      ]
    },
    {
      "tag": "phd age limit",
      "patterns": [
        "Is there any age limit for PhD program?",
        "age limit for phd"
      ],
      "responses": [
        "There is no age limit."
      ]
    },
    {
      "tag": "refundable fee",
      "patterns": [
        "Is application fee refundable?",
        "can i refund my application fee?"
      ],
      "responses": [
        "No"
      ]
    },
    {
      "tag": "postal",
      "patterns": [
        "Is it possible to get the Admit Card through postal mode?"
      ],
      "responses": [
        "Electrical Engineering, Computer Engineering, Mechanical Engineering, Electrical Engineering",
        "AU offers following Engineering programs: Electrical Engineering, Computer Engineering, Mechanical Engineering, Electrical Engineering"
      ]
    },
    {
      "tag": "Internet diconnected",
      "patterns": [
        "My Internet got disconnected while filling the form. What should I do?"
      ],
      "responses": [
        "When you get back the Internet connection, login again with your credentials and fill the information again."
      ]
    },
    {
      "tag": "wrong credentials",
      "patterns": [
        "How can I correct my mistake in the Registration Form? I have uploaded the wrong Photo/ID Proof/ Signature.",
        "How can I correct my mistake in the Registration Form? I have entered wrong credentials"
      ],
      "responses": [
        "Before making the Online Payment, you can generate a Preview and can do the required rectifications. Once you Submit the form, you will not be able to make any changes. Be very careful before Submitting the form."
        
      ]
    },
    {
      "tag": "Final Aggregate",
      "patterns": [
        "What does the Final Aggregate mean? "
      ],
      "responses": [
        "‘Final Aggregate’  is the combined result of all semesters the qualifying exam, i.e. B.A. / B.Com. / B.Sc. (or equivalent) result taken together. You need to fill the same at the time of updating of Qualifying Examination Marks."
        
      ]
    },
    {
      "tag": "syllabus",
      "patterns": [
        "Can you please tell me the syllabus and pattern for the Entrance Exam?",
        "what is the syllabus of entry test?",
        "syllabus of entry test"
      ],
      "responses": [
        " Please visit the website of the respective Department of the University of AU to know the syllabus of the Entrance test."
      ]
    },
    {
      "tag": "hard copy",
      "patterns": [
        "Do I need to send a hard copy of the form?",
        "hard copy of form"
      ],
      "responses": [
        "No, you don‘t need to send the hard copy of the form."
      ]
    },
    {
      "tag": "application form",
      "patterns": [
        "Which are the mandatory fields in the application?",
        "How to fill Application form?"
      ],
      "responses": [
        "While filling the Registration form, you will see an astrix sign * in Red.These fields are mandatory and should be filed carefully."
      ]
    },
    {
      "tag": "friend form",
      "patterns": [
        "I have created my account and filled my Registration Form on the AU Admission Portal. Can I use the same account to fill the Registration Form for my friend?",
        "Can I fill friend form using my account ?"
      ],
      "responses": [
        "No, Each applicant / candidate must create a separate account and fill a separate Online Registration Form."
      ]
    },
    {
      "tag": "gap year",
      "patterns": [
        "I have a gap year? Can I still apply?",
        "gap year",
        "Will there be any disadvantage for gap year students?",
        "I have completed my fsc in 2020 and unfortunately wasted an year, will I be able to apply in AU?"

      ],
      "responses": [
        "yes,you can apply after gap year.",
        "Gap year doesn't matter. you can still apply in AU.",
        "No, there is no disadvantage to gap year students and they would be treated at par with regular students. They should meet the requisite criteria for admission and must possess the necessary documents / certificates."
      ]
    },
    {
      "tag": "edit",
      "patterns": [
        "Can I edit my phone number in application form?",
        "I entereds wrong phone number in application form"
      ],
      "responses": [
        "Your Mobile number is used for all communications related to admissions. Be very carefully while filling your Mobile number as it will not be changed."
      ]
    },
    {
      "tag": "best",
      "patterns": [
        "How do I know if AU is best university for me?",
        "Is AU best for me?"
      ],
      "responses": [
        "We strongly encourage all prospective students to visit campus."
      
      ]
    },
    {
      "tag": "fail",
      "patterns": [
        "What if I fail or my result does not meet eligibility criteria, what would happen to my admission?",
        "fail test",
        "doesn't match eligibility criteria"
      ],
      "responses": [
        "In case you fail or your result does not meet the eligibility criteria, your admission will be cancelled."
      ]
    },
    {
      "tag": "deposit security fee",
      "patterns": [
        "Do we have to deposit security fee?",
        "deposit security fee",
        "security fee"
      ],
      "responses": [
        "Security fee is included in first fee bill."
        
      ]
    },
    {
      "tag": "installments",
      "patterns": [
        "Can I pay my fees in installments?",
        "fee in installments"
      ],
      "responses": [
        "Payment of fees in installment is possible but with prior approval by the Executive Director’s / Registrar’s office.",
        "AU offers following Engineering programs: Electrical Engineering, Computer Engineering, Mechanical Engineering, Electrical Engineering"
      ]
    },
    {
      "tag": "term credit hour",
      "patterns": [
        "What do you mean by Credit Hour?",
        "what is credit hour",
        "credit hour"
      ],
      "responses": [
        "The term ‘Credit Hour’ refers to the instructional or teaching time given to students every week for the entire semester. A 3-credit hour theory course involves 3 hours of instructional time per week"
        
      ]
    },
    {
      "tag": "preparation",
      "patterns": [
        "How can I prepare or entrance test?",
        "prepare entry test",
        "entry test preparation"
      ],
      "responses": [
        "The entrance test consists of questions related to the material you have studied in FSC. "
      ]
    },
    {
      "tag": "past papers",
      "patterns": [
        "From where I can get past papers for entrance test ?",
        "past papers"
      ],
      "responses": [
        "Please click on provided link.  https://www.paked.net/papers/sample_paper_air_university_islamabad.htm"
      ]
    },
    {
      "tag": "less marks",
      "patterns": [
        "How can I apply in AU if I have less than 50% marks in fsc?",
        "less than 50% marks",
        "less marks"
      ],
      "responses": [
        "It's difficult to apply in AU if you have attained marks less than 50% in fsc."
      ]
    },
    {
      "tag": "bscs admission",
      "patterns": [
        "Will I be able to apply for BSCS as I am a improver?",
        "I have attained 65% in HSSC and 77 marks in NTS, Is it possible to get an admission in BSCS in AU Islamabad ?"
      ],
      "responses": [
        "Yes, you can apply based on the eligibility criteria.",
        "Yes, the eligibility criteria to apply for admission is 50% marks. You can apply but admission is only confirm once you clear the entry test."
      ]
    },
    {
      "tag": "D grade",
      "patterns": [
        "Is it possible for a student to get admission even if he has 'D' grades in A levels although the equivalence is above 60% or 70%?",
        "D grade"
      ],
      "responses": [
        "Yes, eligibility criteria to apply in any program is marks above 50%."
      
      ]
    },
    {
      "tag": "intermediate part 1",
      "patterns": [
        "Will the student with lesser marks than 33% in a subject or in Intermediate (pt.1) be eligible ?",
        "marks less than 33% in fsc part 1",
        "marks less than 33% in fsc"
      ],
      "responses": [
        "Your overall total marks must not less than 50%. It doesn't matter if you scored less in one subject or in part 1. if you have secured marks more than 50% in HSSC you are eligible to apply in AU."
        
      ]
    },
    {
      "tag": "pre medical",
      "patterns": [
        "I have done Pre-medical in HSSC. Can I apply for BsCS?",
        "can pre medical students apply for bscs?",
        "Can I apply for BS Computer science after pre medical?"
      ],
      "responses": [
        "Yes but student having the background of pre-medical Students must have to pass deficiency courses of Mathematics of 6 credit hours in first two semesters."
        
      ]
    },
    {
      "tag": "requirements for A levels",
      "patterns": [
        "Are there any essential requirements for an A levels student ?",
        "how can A levels students apply?"
      ],
      "responses": [
        "Such candidates are required to submit an Equivalence Certificate issued by the Inter Board Chairman Committee, Islamabad, before the semester starts. This certificate must indicate the marks equivalent to marks in the Intermediate examination."
        
      ]
    },
    {
      "tag": "NTS test",
      "patterns": [
        "With NTS Test Can We Get Admission?",
        "NTS TEST",
        "NTS ",
        "Can NTS test marks help me in applying ?",
        "Is NTS is compulsory for admission?",
        "To attain an admission, Is it compulsory to clear a NTS test ?"
      ],
      "responses": [
        "Yes, on the basis of NTS test you can get admission but it isn't compulsory"
        
      ]
    },
    { 
      "tag": "test conduction",
      "patterns": [
        "Online or in AU, Where will the test be conducted ?",
        "how will admission test get conducted?",
        "test conducted"
      ],
      "responses": [
        "It will be conducted in Air University Campus."
        
      ]
    },
    {
      "tag": "NAT test",
      "patterns": [
        "Will it be possible to apply with the NAT test results ? Also, It will be declared in the last week of July.",
        "The result of NAT test is going to come out at the end of July. Furthermore, Is it possible to apply on the basis of NAT test ?",
        "NAT",
        "NAT TEST"
      ],
      "responses": [
        "It is necessary to give entry test to get admission in Air University.",
        "Entry Test is compulsory. NAT, NTS are optional tests."
        
      ]
    },
    {
      "tag": "entry test",
      "patterns": [
        "which test is conducted to get admission in Air University?",
        "Which is the essential test for admission in Air University ?"
      ],
      "responses": [
        "Entry Test is compulsory. NAT, NTS are optional tests."
        
      ]
    },
    {
      "tag": "balochistan",
      "patterns": [
        "How can the students from Baluchistan apply ?",
        "Is there anyway through which the students of Balochistan can apply ?",
        "balochistan"
      ],
      "responses": [
        "They have to apply online and give entry test in campus of AU.",
        "Students hailing from Balochistan can apply online but the test will be conducted in campus."
        
      ]
    },
    {
      "tag": "apply",
      "patterns": [
        "What is the procedure of applying and from which website do we have to apply ?",
        "On which website does the application take place and what is its procedure ?",
        "apply"
      ],
      "responses": [
        "You can apply at the admission portal of Air University. the website address is attached below. https://portals.au.edu.pk/admissions/",
        "You have to click on the link attached below. If you already have an account, you can directly apply. But if Not, Create an account and then fill the required information related to the program you want to enroll. link: https://portals.au.edu.pk/admissions/"
      ]
    },
    {
      "tag": "guidance",
      "patterns": [
        "I need guidance towards the attainment of admission in Air University.",
        "I need information on how to get an admission in Air University.",
        "guidance"
      ],
      "responses": [
        "Sure. Click on the link attached below. Create an account after clicking on the link and then fill the form according to the required information. Link: https://portals.au.edu.pk/admissions/"
        
      ]
    },
    {
      "tag": "MS details",
      "patterns": [
        "What is the information regarding admission in Masters degree ?",
        "What is the details for getting admission in Masters Degree ?",
        "What are the updates with regards to the attainment of admission in Masters ?",
        "Is there any information available about getting admission in Masters ?"
      ],
      "responses": [
        "16 years education with minimum 130 Credit Hrs in relevant subject.At least 50% marks or 2.00/4.00 CGPA  AU-GAT(Gen) at least 60% score OR NTS-GAT(Gen) at least 50% score. This must be passed before the date of admission in MS Program.  Candidates will appear for an interview for the purpose of final selection."
        
      ]
    },
    {
      "tag": "fee",
      "patterns": [
        "When should I apply for tests and what is the required amount of form fees ?",
        "How much amount is required for form fees and when can one apply for tests ?",
        "When to apply for tests and Form Fee?",
        "When should I apply for tests and what is the required amount of form fees ?",
        "How much amount is required for form fees and when can one apply for tests ?",
        "I need information on the application of tests and the amount of form fees.",
        "admission fee",
        "What are the date of application of tests and how much is the amount of form fees ?"
      ],
      "responses": [
        "The amount is Rs.1500. You can apply in Fall and Spring. For Fall: July-August. For Spring: January.",
        "You can Apply online on AU website.You can apply in Fall and Spring. For Fall: July-August. For Spring: January. The amount of form fees is Rs.1500. The online link to apply is : https://portals.au.edu.pk/admissions/"
      ]
    },
    {
      "tag": "admission AU",
      "patterns": [
        "What is the procedure to get an admission in AU?",
        "What is the process of attaining an admission in AU ?",
        "How can I attain an admission in AU ?",
        "what is the admission process?",
        "how can I apply for admission?"
      ],
      "responses": [
        "You have to click on the link attached below. If you already have an account, you can directly apply. But if Not, Create an account and then fill the required information related to the program you want to enroll. link: https://portals.au.edu.pk/admissions/"
      ]
    },
    {
      "tag": "semester fee",
      "patterns": [
        "What will the semester fees be If I appear on the merit list?",
        "What is the semester fees of the students who are on the merit list ?",
        "What will my semester fees be after appearing on the merit list ?",
        "How much will my semester fees be if I achieve appearing on the merit list ?",
        "After appearing on the merit list, what will my semester fees be ?"
      ],
      "responses": [
        "It depends on the program you have selected. All the BS Program has different fee structure.",
        "AU offers following Engineering programs: Electrical Engineering, Computer Engineering, Mechanical Engineering, Electrical Engineering"
      ]
    },
    {
      "tag": "fee MBA",
      "patterns": [
        "How much is the fees of MBA ?",
        "What is the amount of fee submission for studying MBA ?",
        "How much fees will one have to pay in order to study MBA ?",
        "What is the information regarding the fees of MBA ?",
        "fee of MSCS",
        "fee of MS Computer Science"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester is Rs.100152"
      ]
    },
    {
      "tag": "fee BSCS",
      "patterns": [
        "I need information on the fee structure of BSCS?",
        "What is the fee structure of BSCS ?",
        "I need to know the fee structure of BSCS.",
        "Is there any information on the fee structure of BSCS ?",
        "fee of BSCS",
        "fee of BS Computer Science"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs.73216"
      ]
    },
    {
      "tag": "fee BSCE",
      "patterns": [
        "I need information on the fee structure of BSCE?",
        "What is the fee structure of BSCE ?",
        "I need to know the fee structure of BS Computer Engineering.",
        "Is there any information on the fee structure of BSCE ?",
        "fee of BSCE",
        "fee of BS Computer Engineering"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs.89,298"
      ]
    },
    {
      "tag": "fee BSEE",
      "patterns": [
        "I need information on the fee structure of BSEE?",
        "What is the fee structure of BS Electrical Engineering ?",
        "I need to know the fee structure of BSEE.",
        "Is there any information on the fee structure of BSEE ?",
        "fee of BS Electrical Engineering",
        "fee of BS BSEE"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 89298"
      ]
    },
    {
      "tag": "fee BSMechanical",
      "patterns": [
        "I need information on the fee structure of BS ME?",
        "What is the fee structure of BS Mechanical Engineering ?",
        "I need to know the fee structure of BS Mechanical Engg.",
        "Is there any information on the fee structure of BS Mechanical Engineering ?",
        "fee of BS Mechanical Engineering",
        "fee of BS BSME"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 84337"
      ]
    },
    {
      "tag": "fee BSMechatronics",
      "patterns": [
        "I need information on the fee structure of BS Mechatronics?",
        "What is the fee structure of BS Mechatronics Engineering ?",
        "I need to know the fee structure of BS Mechatronics Engg.",
        "Is there any information on the fee structure of BS BS Mechatronics ?",
        "fee of BS Mechatronics"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 84337"
      ]
    },
    {
      "tag": "fee Biomedical",
      "patterns": [
        "I need information on the fee structure of Biomedical Engineering?",
        "What is the fee structure of Biomedical Engineering ?",
        "I need to know the fee structure of Biomedical Engineering",
        "Is there any information on the fee structure of Biomedical Engineering ?",
        "fee of BS Bio Medical Engineering",
        "fee of BS Biomedical Engineering"
        
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 89,298"
      ]
    },
    {
      "tag": "fee BBA",
      "patterns": [
        "I need information on the fee structure of BBA?",
        "What is the fee structure of BBA ?",
        "I need to know the fee structure of BBA",
        "Is there any information on the fee structure of BBA ?",
        "fee of BBA"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 91512"
      ]
    },
    {
      "tag": "fee BSAF",
      "patterns": [
        "I need information on the fee structure of BS in Accounting and Finance ??",
        "What is the fee structure for BS in Accounting and Finance ?",
        "I need to know the fee structure of BS in Accounting and Finance ",
        "Is there any information on the fee structure of BS in Accounting and Finance  ?",
        "fee of BS in Accounting and Finance",
        "fee of BSAF"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 77792"
      ]
    },
    {
      "tag": "fee Aviation",
      "patterns": [
        "I need information on the fee structure of BS in Aviation Management ?",
        "What is the fee structure for BS in Aviation Management ?",
        "I need to know the fee structure of BS in Aviation Management",
        "Is there any information on the fee structure of BS in Aviation Management ?",
        "fee of BS in Aviation Management",
        "fee of Aviation Management"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 91512"
      ]
    },
    {
      "tag": "fee tourism",
      "patterns": [
        "I need information on the fee structure of BS Tourism and Hospitality Management ?",
        "What is the fee structure for BS Tourism and Hospitality Management ?",
        "I need to know the fee structure of BS Tourism and Hospitality Management ?",
        "Is there any information on the fee structure of BS Tourism and Hospitality Management?",
        "fee of BS in Tourism and Hospitality Management",
        "fee of Tourism and Hospitality Management"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 91512"
      ]
    },
    {
      "tag": "fee BS Healthcare",
      "patterns": [
        "I need information on the fee structure of BS Healthcare Management?",
        "What is the fee structure for BS Healthcare Management ?",
        "I need to know the fee structure of BS Healthcare Management",
        "Is there any information on the fee structure of BS Healthcare Management",
        "fee of BS Healthcare Management",
        "fee of Healthcare Management"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 91512"
      ]
    },
    {
      "tag": "fee BS Cyber",
      "patterns": [
        "I need information on the fee structure of BS in Cyber Security?",
        "What is the fee structure for BS in Cyber Security ?",
        "I need to know the fee structure of BS in Cyber Security",
        "Is there any information on the fee structure of BS in Cyber Security",
        "fee of BS in Cyber Security",
        "fee of Cyber Security"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 74415"
      ]
    },
    {
      "tag": "fee BS IT",
      "patterns": [
        "I need information on the fee structure of BS in Information Technology?",
        "What is the fee structure for BS in Information Technology?",
        "I need to know the fee structure of BS in Information Technology?",
        "Is there any information on the fee structure of BS in Information Technology?",
        "fee of BS in Information Technology?",
        "fee of BS IT"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 68640"
      ]
    },
    {
      "tag": "fee BSSE",
      "patterns": [
        "I need information on the fee structure of BS in Software Engineering?",
        "What is the fee structure for BS in Software Engineering ?",
        "What is the fee structure for BSSE ?",
        "I need to know the fee structure of BS in Software Engineering?",
        "Is there any information on the fee structure of BS in Software Engineering?",
        "fee of BS in Software Engineering?",
        "fee of BSSE"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 89298"
      ]
    },
    {
      "tag": "fee BS Gaming",
      "patterns": [
        "I need information on the fee structure of BS in Gaming Multimedia?",
        "What is the fee structure for BS in Gaming Multimedia",
        "What is the fee structure for BS in Gaming Multimedia ?",
        "I need to know the fee structure of BS in Gaming Multimedia",
        "Is there any information on the fee structure of BS in Gaming Multimedia?",
        "fee of BS in Gaming Multimedia?",
        "fee of BSGM"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 84337"
      ]
    },
    {
      "tag": "fee BSAI",
      "patterns": [
        "I need information on the fee structure of BS in Artificial Intelligence?",
        "What is the fee structure for BS in Artificial Intelligence ?",
        "I need to know the fee structure of BS in Artificial Intelligence",
        "Is there any information on the fee structure of BS in Artificial Intelligence?",
        "fee of BS in Artificial Intelligence?",
        "fee of BSAI"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 138600"
      ]
    },
    {
      "tag": "fee BSEng",
      "patterns": [
        "I need information on the fee structure of BS English?",
        "What is the fee structure for BS English ?",
        "I need to know the fee structure of BS English",
        "Is there any information on the fee structure of BS English?",
        "fee of BS English?",
        "fee of BS Eng"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 56576"
      ]
    },
    {
      "tag": "fee BSPsychology",
      "patterns": [
        "I need information on the fee structure of BS Psychology?",
        "What is the fee structure for BS Psychology?",
        "I need to know the fee structure of BS Psychology",
        "Is there any information on the fee structure of BS Psychology?",
        "fee of BS Psychology?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 56576"
      ]
    },
    {
      "tag": "fee BSPhysics",
      "patterns": [
        "I need information on the fee structure of BS physics?",
        "What is the fee structure for BS physics ?",
        "I need to know the fee structure of BS physics",
        "Is there any information on the fee structure of BS physics?",
        "fee of BS in BS physics?",
        "fee of BS phys"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 54592"
      ]
    },
    {
      "tag": "fee BSMaths",
      "patterns": [
        "I need information on the fee structure of BS Mathematics?",
        "What is the fee structure for BS Mathematics ?",
        "I need to know the fee structure of BS Mathematics",
        "Is there any information on the fee structure of BS Mathematics?",
        "fee of BS in BS Mathematics?",
        "fee of BS Maths"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 138600"
      ]
    },
    {
      "tag": "fee BSIR",
      "patterns": [
        "I need information on the fee structure of BS IR (International Relations)?",
        "What is the fee structure for BS IR (International Relations) ?",
        "I need to know the fee structure of BS IR (International Relations)",
        "Is there any information on the fee structure of BS IR (International Relations)?",
        "fee of BS IR (International Relations)?",
        "fee of BSIR"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 91512"
      ]
    },
    {
      "tag": "fee MSManagement",
      "patterns": [
        "I need information on the fee structure of MS in Management Sciences?",
        "What is the fee structure for MS in Management Sciences ?",
        "I need to know the fee structure of MS in Management Sciences",
        "Is there any information on the fee structure of MS in Management Sciences?",
        "fee of MS in Management Sciences?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 78708"
      ]
    },
    {
      "tag": "fee MSProject",
      "patterns": [
        "I need information on the fee structure of MS Project Management?",
        "What is the fee structure for MS Project Management ?",
        "I need to know the fee structure of MS Project Management",
        "Is there any information on the fee structure of MS Project Management?",
        "fee of MS in Project Management"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 70272"
      ]
    },
    {
      "tag": "fee MSBusiness",
      "patterns": [
        "I need information on the fee structure of MS Business Analytics?",
        "What is the fee structure for MS Business Analytics ?",
        "I need to know the fee structure of MS Business Analytics",
        "Is there any information on the fee structure of MS Business Analytics?",
        "fee of MS Business Analytics?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 138600"
      ]
    },
    {
      "tag": "fee MSAI",
      "patterns": [
        "I need information on the fee structure of MS in Artificial Intelligence?",
        "What is the fee structure for MS in Artificial Intelligence ?",
        "I need to know the fee structure of MS in Artificial Intelligence",
        "Is there any information on the fee structure of MS in Artificial Intelligence?",
        "fee of MS in Artificial Intelligence?",
        "fee of MSAI"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 77000"
      ]
    },
    {
      "tag": "fee MS Gaming",
      "patterns": [
        "I need information on the fee structure of MS in Gaming Multimedia?",
        "What is the fee structure for MS in Gaming Multimedia",
        "What is the fee structure for MS in Gaming Multimedia ?",
        "I need to know the fee structure of MS in Gaming Multimedia",
        "Is there any information on the fee structure of MS in Gaming Multimedia?",
        "fee of MS in Gaming Multimedia?",
        "fee of MSGM"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 65590"
      ]
    },
    {
      "tag": "fee MS Data Science",
      "patterns": [
        "I need information on the fee structure of MS Data Science?",
        "What is the fee structure for MS Data Science?",
        "I need to know the fee structure of MS Data Science",
        "Is there any information on the fee structure of MS Data Science?",
        "fee of MS Data Science?",
        "fee of MS DS"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 65590"
      ]
    },
    {
      "tag": "fee MS System Security",
      "patterns": [
        "I need information on the fee structure of MS System Security?",
        "What is the fee structure for MS System Security?",
        "I need to know the fee structure of MS System Security",
        "Is there any information on the fee structure of MS System Security?",
        "fee of MS System Security?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 65590"
      ]
    },
    {
      "tag": "fee MS Cyber",
      "patterns": [
        "I need information on the fee structure of MS Cyber Security?",
        "What is the fee structure for MS Cyber Security ?",
        "I need to know the fee structure of MS Cyber Security",
        "Is there any information on the fee structure of MS Cyber Security?",
        "fee of MS Cyber Security?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 65590"
      ]
    },
    {
      "tag": "fee MS IT",
      "patterns": [
        "I need information on the fee structure of MS in Information Technology?",
        "What is the fee structure for MS in Information Technology?",
        "I need to know the fee structure of MS in Information Technology?",
        "Is there any information on the fee structure of MS in Information Technology?",
        "fee of MS in Information Technology?",
        "fee of MS IT"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 65590"
      ]
    },
    {
      "tag": "fee MS AppliedPhysics",
      "patterns": [
        "I need information on the fee structure of MS Applied Physics?",
        "What is the fee structure for MS Applied Physics ?",
        "I need to know the fee structure of MS Applied Physics",
        "Is there any information on the fee structure of MS Applied Physics?",
        "fee of MS Applied Physics?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 78708"
      ]
    },
    {
      "tag": "fee MS Mathematics",
      "patterns": [
        "I need information on the fee structure of MS Mathematics?",
        "What is the fee structure for MS Mathematics ?",
        "I need to know the fee structure of MS Mathematics",
        "Is there any information on the fee structure of MS Mathematics?",
        "fee of MS Mathematics?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 85267"
      ]
    },
    {
      "tag": "fee MSLinguistics",
      "patterns": [
        "I need information on the fee structure of MS/M.Phil. in Linguistics & Literature?",
        "What is the fee structure for MS/M.Phil. in Linguistics & Literature ?",
        "I need to know the fee structure of MS/M.Phil. in Linguistics & Literature",
        "Is there any information on the fee structure of MS/M.Phil. in Linguistics & Literature?",
        "fee of MS/M.Phil. in Linguistics & Literature?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 53676"
      ]
    },
    {
      "tag": "fee MS Education",
      "patterns": [
        "I need information on the fee structure of MS/M.Phil. in Education?",
        "What is the fee structure for MS/M.Phil. in Education ?",
        "I need to know the fee structure of MS/M.Phil. in Education",
        "Is there any information on the fee structure of MS/M.Phil. in Education?",
        "fee of BS in MS/M.Phil. in Education"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 53676"
      ]
    },
    {
      "tag": "fee MS Clinical",
      "patterns": [
        "I need information on the fee structure of MS in Clinical Psychology?",
        "What is the fee structure for MS in Clinical Psychology ?",
        "I need to know the fee structure of MS in Clinical Psychology",
        "Is there any information on the fee structure of MS in Clinical Psychology",
        "fee of MS in Clinical Psychology"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 92400"
      ]
    },
    {
      "tag": "fee MS Strategic",
      "patterns": [
        "I need information on the fee structure of MS Strategic Studies?",
        "What is the fee structure for MS in Strategic Studies ?",
        "I need to know the fee structure of MS Strategic Studies",
        "Is there any information on the fee structure of MS Strategic Studies?",
        "fee of MS Strategic Studies?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 53676"
      ]
    },
    {
      "tag": "MS Biomedical",
      "patterns": [
        "I need information on the fee structure of MS Bio-Medical Engineering?",
        "What is the fee structure for MS Bio-Medical Engineering ?",
        "I need to know the fee structure of MS Bio-Medical Engineering",
        "Is there any information on the fee structure of MS Bio-Medical Engineering?",
        "fee of MS Bio-Medical Engineering?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 69300"
      ]
    },
    {
      "tag": "MS Avionics",
      "patterns": [
        "I need information on the fee structure of MS Avionics Engineering?",
        "What is the fee structure for MS Avionics Engineering ?",
        "I need to know the fee structure of MS Avionics Engineering",
        "Is there any information on the fee structure of MS Avionics Engineering?",
        "fee of MS Avionics Engineering?"
      ],
      "responses": [
        "TTution Fee as Per Cr. Hr. for 1st Semester Rs. 44730"
      ]
    },
    {
      "tag": "MS Aerospace",
      "patterns": [
        "I need information on the fee structure of MS Aerospeace Engineering?",
        "What is the fee structure for MS Aerospeace Engineering ?",
        "I need to know the fee structure of MS Aerospeace Engineering",
        "Is there any information on the fee structure of MS Aerospeace Engineering?",
        "fee of MS Aerospeace Engineering?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 40257"
      ]
    },
    {
      "tag": "MS Mechatronics",
      "patterns": [
        "I need information on the fee structure of MS Mechatronics Engineering?",
        "What is the fee structure for MS Mechatronics Engineering ?",
        "I need to know the fee structure of MS Mechatronics Engineering",
        "Is there any information on the fee structure of MS Mechatronics Engineering?",
        "fee of MS Mechatronics Engineering?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 40257"
      ]
    },
    {
      "tag": "MS Mechanical",
      "patterns": [
        "I need information on the fee structure of MS Mechanical Engineering?",
        "What is the fee structure for MS Mechanical Engineering ?",
        "I need to know the fee structure of MS Mechanical Engineering",
        "Is there any information on the fee structure of MS Mechanical Engineering?",
        "fee of MS Mechanical Engineering?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 40257"
      ]
    },
    {
      "tag": "MS Electrical Engineering",
      "patterns": [
        "I need information on the fee structure of MS Electrical Engineering?",
        "What is the fee structure for MS Electrical Engineering ?",
        "I need to know the fee structure of MS Electrical Engineering",
        "Is there any information on the fee structure of MS Electrical Engineering?",
        "fee of MS Electrical Engineering?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 40257"
      ]
    },
    {
      "tag": "Phd Linguistics",
      "patterns": [
        "I need information on the fee structure of phd. Linguistics and Literature ? ",
        "What is the fee structure for phd. Linguistics and Literature?",
        "I need to know the fee structure of phd. Linguistics and Literature ",
        "Is there any information on the fee structure of phd. Linguistics and Literature ? ",
        "fee of phd. Linguistics and Literature ?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 48792"
      ]
    },
    {
      "tag": "Phd Electrical",
      "patterns": [
        "I need information on the fee structure of Phd. Electrical?",
        "What is the fee structure for Phd. Electrical ?",
        "I need to know the fee structure of Phd. Electrical",
        "Is there any information on the fee structure of Phd. Electrical?",
        "fee of Phd. Electrical?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 36594"
      ]
    },
    {
      "tag": "Phd Aerospace",
      "patterns": [
        "I need information on the fee structure of Phd. Aerospace?",
        "What is the fee structure for Phd. Aerospace ?",
        "I need to know the fee structure of Phd. Aerospace",
        "Is there any information on the fee structure of Phd. Aerospace?",
        "fee of Phd. Aerospace?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 36594"
      ]
    },
    {
      "tag": "Phd Computer",
      "patterns": [
        "I need information on the fee structure ofPhd. Computer Science?",
        "What is the fee structure for Phd. Computer Science ?",
        "I need to know the fee structure of Phd. Computer Science",
        "Is there any information on the fee structure of Phd. Computer Science?",
        "fee of Phd. Computer Science?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 36594"
      ]
    },
    {
      "tag": "Phd Management",
      "patterns": [
        "I need information on the fee structure of Phd. Management Sciences?",
        "What is the fee structure for Phd. Management Sciences ?",
        "I need to know the fee structure of Phd. Management Sciences",
        "Is there any information on the fee structure of Phd. Management Sciences?",
        "fee of Phd. Management Sciences?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 36594"
      ]
    },
    {
      "tag": "Phd Mechanical",
      "patterns": [
        "I need information on the fee structure of Phd. Mechanical Engineering?",
        "What is the fee structure for Phd. Mechanical Engineering ?",
        "I need to know the fee structure of Phd. Mechanical Engineering",
        "Is there any information on the fee structure of Phd. Mechanical Engineering?",
        "fee of Phd. Mechanical Engineering?"
      ],
      "responses": [
        "Tution Fee as Per Cr. Hr. for 1st Semester Rs. 36594"
      ]
    },
    {
      "tag": "AAPC",
      "patterns": [
        "What is Admission Application Processing Charges?",
        "Admission Application Processing Charges?"
      ],
      "responses": [
        "Rs. 2000 (Non-Refundable)"
      ]
    },
    {
      "tag": "Admission fee",
      "patterns": [
        "What is Admission Fee in fee structure ?",
        "Admission Fee?"
      ],
      "responses": [
        "Rs. 20,000.  At the time of Admission (Non-Refundable)"
      ]
    },
    {
      "tag": "Security deposit",
      "patterns": [
        "How much is Security Deposit?",
        "Security deposit",
        "Security fee"
      ],
      "responses": [
        "Rs. 10,000   (Refundable After Clearance)"
      ]
    },
    {
      "tag": "Endowment Fund",
      "patterns": [
        "How much is Endowment Fund ?",
        "Endowment Fund"
      ],
      "responses": [
        "Rs. 5,000.  At the time of Admission (Non-Refundable)"
      ]
    },
    {
      "tag": "Convocation Charges",
      "patterns": [
        "How much is Convocation Charges ?",
        "Convocation Charges"
      ],
      "responses": [
        "Rs. 5,000.  Applicable in last Year (Non-Refundable)"
      ]
    },
    {
      "tag": "thesis Evaluation Fee",
      "patterns": [
        "How much is Thesis Evaluation Fee ?",
        "thesis Evaluation Fee"
      ],
      "responses": [
        "Rs. 20,000. Applicable in last semester (Non-Refundable)"
      ]
    },
    {
      "tag": "Event fee",
      "patterns": [
        "How much is Students' Event fee ?",
        "Student event fee"
      ],
      "responses": [
        "Rs. 1,000 Per Semester (Non-Refundable)"
      ]
    },
    {
      "tag": "Sports Fee",
      "patterns": [
        "How much is Sports Fee ?",
        "Sports Fee"
      ],
      "responses": [
        "Rs. 1,000 Per Semester (Non-Refundable)"
      ]
    },
    {
      "tag": "Library Fee",
      "patterns": [
        "How much is Library Fee?",
        "Library Fee"
      ],
      "responses": [
        "Rs. 500 Per Semester (Non-Refundable)"
      ]
    },
    {
      "tag": "Exam fee",
      "patterns": [
        "How much is Exam fee ?",
        "Exam fee"
      ],
      "responses": [
        "Rs.2,000 Per Semester (Not applicable to PG student's when only registered in Thesis during semester studies)"
      ]
    },
    {
      "tag": "Rejoining Fee",
      "patterns": [
        "How much is Re-Joining Fee ?",
        "Rejoining fee"
      ],
      "responses": [
        "Rs.3,000 After Semester leave (if availed)"
      ]
    },
    {
      "tag": "Extension period fee",
      "patterns": [
        "How much is Extension Period Fee (For MS & PhD Students) ? ",
        "Extension period fee"
      ],
      "responses": [
        "Other than applicable Allied Charges 6 x credit hrs fee as per existing rate would be applied in each extended semester."
      ]
    },
    {
      "tag": "hostel",
      "patterns": [
        "Is there any in-campus hostel ?",
        "Is there any on-campus hostel ?",
        "hostel"
      ],
      "responses": [
        "Yes, but that hostel is only for girls. "
      ]
    },
    {
      "tag": "CS Entry test",
      "patterns": [
        "I have cleared FSC. with chemistry and now I opt to apply for BSCS, What will my entry test be from, computer or chemistry ?",
        "Will my entry test for BSCS contain questions from Chemistry along with Computer, as I have cleared my FSC. with Chemistry ?",
        "Will the entry test of BSCS contain information only regarding computer even if I have cleared my FSC. with Chemistry ?",
        "Chemistry or computer, What will my entry test for BSCS contain if I have passed my FSC. with chemistry ?",
        "Currently applying for BSCS, Will my entry test have questions from Chemistry besides computer as I have passed my FSC. with Chemistry ?",
        "Pattern of BSCS",
        "Pattern of BS Computer Science"
      ],
      "responses": [
        "English (25%)  , Math (55%)  , Physics (20%)   =   Total (100%)"
      ]
    },
    {
      "tag": "BSCS Subjects",
      "patterns": [
        "Are there any specific subject required for an admission in BSCS ?",
        "Is there any necessary subjects required for an admission in BSCS ?",
        "Is there any necessary subjects required for an admission in BSCS ?",
        "What are the necessary subject requirements for BSCS ?",
        "Which subjects are required for an admission in BSCS ?",
        "Which subjects are essential with regards to getting an admission in BSCS ?",
        "Are there any specific subject required for an admission in BSCS ?",
        "Which subjects are essential with regards to getting an admission in BSCS ?"
      ],
      "responses": [
        "You must have a background of Mathematics and physics. Students who opted for Biology in HSSC must have must have to pass deficiency courses of Mathematics of 6 credit hours in first two semesters.",
        "Entry test contains following subjects. English (25%)  , Math (55%)  , Physics (20%)   =   Total (100%)"
      ]
    },
    {
      "tag": "BSCS Physics",
      "patterns": [
        "Does BSCS entry test contain MCQ's from Physics ?",
        "Are MCQ's from physics added in BSCS entry test ?",
        "Will the entry test of BSCS have MCQ's from physics ?"
 
      ],
      "responses": [
        "Yes, 20% MCQ's are from Physics."
      ]
    },
    {
      "tag": "engineering entry test",
      "patterns": [
        "What is the pattern of AU Engineering entry test ?",
        "I need information about the AU Engineering pattern of entry test.",
        "Is it possible for someone to tell me about the AU Engineering entry test ?",
        "What are the details regarding the AU Engineering entry test ?"
      ],
      "responses": [
        "English(20%) ,  Math (45%) , Physics (35%)  =   Total (100%)"
      ]
    },
    {
      "tag": "sports basis",
      "patterns": [
        "What is the procedure for taking admission in Air University on the basis of sports ?",
        "What procedure should be followed for taking admission in AU on the basis of sports ?",
        "What is the process one should proceed for taking admission in in AU on the basis of sports ?",
        "If a student wants to take admission in in AU on the basis of sports, what procedure is recommended for him ?",
        "If a student wants to take admission in in Air University on the basis of sports, what would be the process he/she will have to go through ?",
        "can I apply on sports basis ?",
        "sport basis"
      ],
      "responses": [
        "Sorry to inform you, AU doesn't provide admission on the basis of sports."
      ]
    },
    {
      "tag": "self finance",
      "patterns": [
        "What is the information regarding the Self-Finance seat ?",
        "What are the details about the Self-Finance seat ?",
        "What are the updates in regards to the Self-Finance seat ?",
        "Self-Finance seat "
      ],
      "responses": [
        "I feel regret to inform you, there is no Self-Finance seat available in AU."
      ]
    },
    {
      "tag": "oversea domicile",
      "patterns": [
        "Is There Any Need Of Domicile If We Apply Online From As Overseas Pakistani?",
        "Does an Overseas Pakistani also has to provide domicile for applying online ?",
        "Being an Overseas Pakistani, Do I too have to provide a domicile in order to apply online ?",
        "Is domicile required even from Overseas Pakistani while online application ?",
        "Applying online as an overseas Pakistani, Will I still have to provide a domicile?",
        "Will a domicile still be necessary if I apply online as an overseas Pakistani ?",
        "overseas pakistani"
      ],
      "responses": [
        "Overseas pakistani can take admission in AU but Domicile is a must document for the admission.",
        "AU offers following Engineering programs: Electrical Engineering, Computer Engineering, Mechanical Engineering, Electrical Engineering"
      ]
    },
    {
      "tag": "academic warning",
      "patterns": [
        "What is minimum CGPA requirement to avoid academic warning?",
        "How much gpa is needed to avoid warning?",
        "how much gpa i need to avoid warning?",
        "can i avoid warning if i have gpa above 2 ?",
        "minimum gpa",
        "minimum cgpa"
      ],
      "responses": [
        "Minimum 2:00",
        "Minimum 2:00 but work hard to improve your gpa."
      ]
    },
    {
      "tag": "gpa calculation",
      "patterns": [
        "how gpa is calculated?",
        "i want to calculate my gpa -how do i calculate gpa ?",
        "how should one calculate gpa",
        "ways to calculate sgpa",
        "how should one calculate gpa",
        "gpa calculation"
      ],
      "responses": [
        "Multiply the point value of the letter grade by the number of credit hours. The result is the quality points earned. Total the credit hours for the term. Total the quality points for the term. Divide the total quality points by the total credit hours. The result is the G.P.A. for the term. You can click on the link too if you want to calculate the GPA online. https://gpacalculator.net/college-gpa-calculator/"
      ]
    },
    {
      "tag": "cgpa calculation",
      "patterns": [
        "how do i calculate cgpa",
        "How does the calculation of CGPA take place?",
        "How is the CGPA calculated ?",
        "How do we calculate CGPA?",
        "What is the formula of calculating CGPA?",
        "cgpa calculation"
      ],
      "responses": [
        "Sum the SGPA of all the semesters and then divide it by total number of semesters. you can also use AU online gpa/cgpa calculator to calculate your cgpa."
      ]
    },
    {
      "tag": "cafe",
      "patterns": [
        "Is cafeteria available at Air University ?",
        "Is there any cafe in AU ?",
        "cafe"
      ],
      "responses": [
        "Yes, there are two cafeterias available in AU."
      ]
    },
    {
      "tag": "mosque",
      "patterns": [
        "Is mosque available in Air University ?",
        "mosque service at AU ?",
        "Mosque"
      ],
      "responses": [
        "yes, there is a proper mosque in AU Campus to offer prayers."
      ]
    },
    {
      "tag": "auditorium",
      "patterns": [
        "is auditorium available at AU ?",
        "auditorium in Air university ?",
        "auditorium"
      ],
      "responses": [
        "Yes, there is fully Furnished Auditorium available in AU to conduct different events."
      ]
    },
    {
      "tag": "headquarter",
      "patterns": [
        "where is headquarter of Air University ?",
        "where is headquarter located ?",
        "location of AU headquarter",
        "Air University headquarter location ?"
      ],
      "responses": [
        "E-9 Complex, Islamabad"
      ]
    },
    {
      "tag": "admin office",
      "patterns": [
        "where is admin office located ?",
        "where is admin office?",
        "student admin office ?",
        "admin office"
      ],
      "responses": [
        "There is a block named Admin block located inside the AU Campus."
      ]
    },
    {
      "tag": "placement office",
      "patterns": [
        "How to contact placement office of AU ?",
        "Contact of Placement office ?",
        "What is the email of placement office ?",
        "placement office",
        "What is the Phone No of Placement office of AU ?",
        "What is the extension number of placement office of AU ?",
        "What is the Ext No of placement office ?"
      ],
      "responses": [
        "please feel free to contact the placement office at email placement@mail.au.edu.pk or via phone number 051-9262557 Ext 320, 270 during our regular office hours of 8:30 am – 4:30 pm, Monday thru Friday."
        
      ]
    },
    {
      "tag": "student affairs",
      "patterns": [
        "What is the role of student affairs department of Air university ?",
        "student affairs department"
      ],
      "responses": [
        "The department is responsible to ensure implementation of the general code of conduct i.e. dress code, discipline and behavioral standards etc. In administration and supporting role, the department facilitates students in organizing various inter/intra/extracurricular activities"
        
      ]
    },
    {
      "tag": "deputy",
      "patterns": [
        "Who is the deputy VC ?",
        "deputy VC"
      ],
      "responses": [
        "MR. AMJAD FAROOQ. To contact him, Call on 9153202 or Email at: amjad@mail.au.edu.pk"
      ]
    },
    {
      "tag": "dean strategic studies",
      "patterns": [
        "Who is Dean of offers MS in Strategic Studies ?",
        "Dean of Strategic Studies"
      ],
      "responses": [
        "Dr. Adil Sultan"
      ]
    },
    {
      "tag": "faculty strategic",
      "patterns": [
        "faculty strategic",
        "Who are members of Faculty of Aerospace and Strategic Studies (FASS)?"
      ],
      "responses": [
        "Dean Dr Adil Sultan, Assistant Professor Dr. Sahibzada Muhammad Usman, Assistant Professor Dr. Mansur Umar Khan, Lecturer Ms. Aiza Azam and Lecturer Mrs. Ayesha A Malik."
      ]
    },
    {
      "tag": "programs strategic",
      "patterns": [
        "Which programs are offered by Faculty of Aerospace Science and Strategic Studies?",
        "programs by Aerospace Science",
        "programs by Strategic Studies?"
      ],
      "responses": [
        "Bachelors of Science International Relations, Master Programs, MS in Strategic Studies Curriculum."
      ]
    },
    {
      "tag": "AU faculties",
      "patterns": [
        "Which faculties are in Air University?",
        "faculties"
      ],
      "responses": [
        "There are seven faculties in Air University. These are faculty of aerospace sciences and strategic studies, Faculty of Avionics and Aeronautics, Faculty of Basic and Applied Sciences, Faculty of Computing and Artificial Intelligence, Faculty of Engineering, faculty of social sciences and Air University School of Management."
        
      ]
    },
    {
      "tag": "head avionics",
      "patterns": [
        "Who is the head of Faculty of Avionics and Aeronautics? ?",
        "Head of avionics and aeronautics"
      ],
      "responses": [
        "Director General Dr. Ibraheem Hanif."
      ]
    },
    {
      "tag": "programs avionics",
      "patterns": [
        "Which programs are being offered in department of Avionics Engineering?",
        "programs by avionics"
      ],
      "responses": [
        "The Avionics Engineering Department of IAA offers BS, MS and PhD degrees in Avionics Engineering and MS in Information Security."
      ]
    },
    {
      "tag": "staff avionics",
      "patterns": [
        "How much teaching staff is in department of Avionics Engineering?"
      ],
      "responses": [
        "At present 12 members are teaching."
      ]
    },
    {
      "tag": "labs Avionics",
      "patterns": [
        "Is there any labs in Avionics ?",
        "labs in Avionics",
        "how many labs are in Avionics?",
        "how many labs are in Avionics department"
      ],
      "responses": [
        "Yes, there is an Avionics Integration Lab, Electro Optics Lab, Aerospace Sensors and Systems lab, Communication Security & Embedded Systems Lab, ECM & Radar Lab and Micro Electro- Mechanical Systems Lab."
      ]
    },
    {
      "tag": "short avionics",
      "patterns": [
        "Is there any training or short courses offered in department of Avionics engineering?",
        "short courses avionics"
      ],
      "responses": [
        "following short courses and trainings are conducted at Department of Avionics Engineering: Synthetic Aperture Radar Theory and Application, LabVIEW Core I & II, LabVIEW FPGA, MEMS for Aerospace Application, Real Time DSP for Communications, Vx Works & FPGA Digital Design with LabVIEW, Modelling &amp; Simulation of Aircraft Dynamics, Avionics System Integration, Navigation Systems, Basics of Energetic Materials, Advanced Energetic Materials, Laser Optics and laser  Proximity Fuses, Explosive Formulation and Fillings, Detection and Analysis of Explosives, Salient Projects."
        
      ]
    },
    {
      "tag": "head mechanical",
      "patterns": [
        "Who is head of department of mechanical and aerospace engineering?",
        "head of mechanical",
        "head of aerospace department"
      ],
      "responses": [
        "Dr. Ibraheem Haneef is the head of department of mechanical and aerospace engineering."
      ]
    },
    {
      "tag": "faculty mechanical",
      "patterns": [
        "How many faculty members are in department of mechanical and aerospace engineering?",
        "faculty members in mechanical and aerospace"
      ],
      "responses": [
        "There are 28 faculty members in department of mechanical and aerospace engineering."
      ]
    },
    {
      "tag": "lab engineeers mechanical",
      "patterns": [
        "How many lab engineers are in department of mechanical and aerospace engineering?",
        "lab engineers in mechanical"
      ],
      "responses": [
        "There are 7 lab engineers in department of mechanical and aerospace engineering."
      ]
    },
    {
      "tag": "lecturers mechanical",
      "patterns": [
        "How many lecturers are in department of mechanical and aerospace engineering?",
        "lecturers in mechanical"
      ],
      "responses": [
        "There are 13 lecturers in department of mechanical and aerospace engineering."
      ]
    },
    {
      "tag": "labs mechanical",
      "patterns": [
        "How many labs are in mechanical and aerospace engineering department?",
        "labs mechaical department",
        "labs aerospace department"
      ],
      "responses": [
        "There are 14 labs in department of mechanical and aerospace engineering.",
        "There are 14 labs in department of mechanical and aerospace engineering, which are Computer Numerical Control Lab, Engineering Mechanics Lab, Fluid mechanics Lab, Heat and Mass Transfer Lab, Instrumentation, Controls and Measurements Lab, Internal Combustion Engine Lab, Mechanical Vibration Lab, Mechanical Workshop, Mechanics of Machines Lab, Mechanics of Materials Lab, Thermodynamics Lab, Engineering Drawing & Graphics Lab, Computer Aided Engineering Lab and 12 Workstation (07 Old + 05 New)."
      ]
    },
    {
      "tag": "objectives mechanical",
      "patterns": [
        "What are the educational objectives of department of mechanical and aerospace engineering?"
      ],
      "responses": [
        "The Department of Mechanical and Aerospace Engineering has formulated the following Program Educational Objectives for its BE Mechanical Engineering Program: PEO 1: Employable graduates with in-depth knowledge and sound understanding of principles of Mechanical Engineering with a quest for lifelong learning. PEO 2: Graduates demonstrating the capacity to assume social, environmental and ethical responsibility in the national and global perspective. PEO 3: Graduates with capability to be effective team members and take a leadership role in research, design, innovation, implementation and operation of Mechanical and related systems. PEO 4: Graduates who can communicate effectively with those inside and outside of Engineering Community and be able to exhibit social and professional responsibility in national and global context."
      ]
    },
    {
      "tag": "programs mechanical",
      "patterns": [
        "Which programs are offered by department of mechanical and aerospace engineering in air university?",
        "programs by mechanical department",
        "programs offered by mechanical department",
        "programs offered by avionics department"
      ],
      "responses": [
        "The department of mechanical and aerospace engineering is offering BS Mechanical engineering, MS Mechanical Engineering, MS Aerospace Engineering, PHD in Mechanical Engineering and PHD in Aerospace Engineering."
      ]
    },
    {
      "tag": "cedit hrs mechanical",
      "patterns": [
        "How many credit hours are in degree of BS Mechanical Engineering in Air university?",
        "cedit hrs in mechanical engineering"
      ],
      "responses": [
        "There are 136 credit hours in degree of BSME."
      ]
    },
    {
      "tag": "duration mechanical",
      "patterns": [
        "What is duration of BS Mechanical Engineering from air University?",
        "duration of BS mechanical engineering"
      ],
      "responses": [
        "The duration of BS Mechanical Engineering program is 4 years."
      ]
    },
    {
      "tag": "eligibility mechanical",
      "patterns": [
        "What is the eligibility Criteria for BS mechanical engineering in Air University?",
        "What is the eligibility Criteria for BS mechanical engineering "
      ],
      "responses": [
        "To be eligible for the program of BSME from air university the Applicants should have at least 6o percent marks in F.Sc. A-Level or equivalent, Must pass the entry test and Qualify in the interview."
        
      ]
    },
    {
      "tag": "mechanical MS programs",
      "patterns": [
        "Is the department of Mechanical and Aerospace engineering offering Graduate programs?",
        "Is department of mechanical and aerospace engineering in Air university offering MS Programs?",
        "Is MS in Mechanical engineering being offered by Air university?",
        "Is MS in Aerospace engineering being offered by Air university?"
      ],
      "responses": [
        "Yes it is offering MS programs in both Mechanical and Aerospace Engineering."
      ]
    },
    {
      "tag": "major areas mechanical",
      "patterns": [
        "What are the major areas of studies in BS Mechanical engineering program in Air University?"
      ],
      "responses": [
        "DMAE has adopted the following main streams for its BE Mechanical Engineering program: Solid Mechanics and Design, Thermofluids and Manufacturing."
      ]
    },
    
    {
      "tag": "eligibilty MS Mechanical",
      "patterns": [
        "What is eligibility Criteria for MS Mechanical engineering program in air university?",
        "eligibilty criteria for MS Mechanical",
        "What is eligibility Criteria for MS aerospace engineering program in air university?",
        "eligibility criteria for MSME",
        "eligibility criteria for MS aerospace"
      ],
      "responses": [
        "Minimum 60 percent or 2.50/4.00 GPA in BE/BSc (Mechanical, Aerospace, Aeronautical, Mechatronics, Chemical) and GRE (General) /GAT conducted by NTS (min 50 percent)"
      ]
    },
    {
      "tag": "credit MS Mechanical",
      "patterns": [
        "How many credit hours are included in MS mechanical engineering program from air university?",
        "credit hours of MS mechanical engineering ?",
        "How many credit hours are included in MS aerospace engineering program from air university?",
        "credit hours of MS mechanical engineering ?"
      ],
      "responses": [
        "Total 31 credit hours "
      ]
    },
    {
      "tag": "phd mechanical",
      "patterns": [
        "Is PhD offered in department of mechanical and aerospace engineering?",
        "phd in mechanical",
        "phd in aerospace",
        "Is Air university offering PhD in mechanical engineering?",
        "Is air university offering PhD in aerospace engineering?"
      ],
      "responses": [
        "Yes, department of mechanical and aerospace engineering is offering PhD program."
      ]
    },
    {
      "tag": "duration phd mechanical",
      "patterns": [
        "What is duration of PhD in mechanical engineering?",
        "What is duration of PhD in aerospace engineering?"
      ],
      "responses": [
        "The duration of PhD is maximum 04 years after MS (Extendable by two years)."
      ]
    },
    {
      "tag": "credit hrs phd mechanical",
      "patterns": [
        "How many credit hours are in PhD in mechanical engineering?",
        "How many credit hours are in PhD in aerospace engineering?"
      ],
      "responses": [
        "there are total forty-eight credit hours 18 Credit Hours of Course work, 30 Credit Hours of dissertation work"
      ]
    },
    {
      "tag": "eligibilty phd mechanical",
      "patterns": [
        "What is the eligibility criteria for PhD in mechanical engineering?",
        "What is the eligibility criteria for PhD in aerospace engineering?"
      ],
      "responses": [
        "MS/MPhil/equivalent degree in the relevant field meeting 30 Credit Hours with a CGPA of at least 3.00 (on the scale of 4.00) or first division in annual system Passing GRE (subject) or GAT (subject) by NTS with at least 60 percent marks."
      ]
    },
    {
      "tag": "research mechanical",
      "patterns": [
        "Is there any research work being done in department of mechanical engineering?",
        "Is there any research work being done in department of aerospace engineering?"
      ],
      "responses": [
        "Yes it’s being done."
      ]
    },
    {
      "tag": "phd avionics",
      "patterns": [
        "Is PhD offered in department of avionics engineering in air university?",
        "phd in avionics?"
      ],
      "responses": [
        "Yes Air university’s department of avionics engineering is offering PhD in avionics engineering."
      ]
    },
    {
      "tag": "cedit hrs phd avionics",
      "patterns": [
        "How many credit hours are in PhD program of avionics engineering?",
        "credit hours in PhD program of avionics"
      ],
      "responses": [
        "There are total 49 credit hours for PhD in avionics engineering from which 19 are for course work and 30 for research work."
      ]
    },
    {
      "tag": "head sciences",
      "patterns": [
        "Who is the head of department of basic and Applied Sciences?",
        "head of basic and Applied Sciences?"
      ],
      "responses": [
        "Dr. Rashid Mahmood is the Dean of the department of basic and applied sciences."
      ]
    },
    {
      "tag": "head physics",
      "patterns": [
        "Who is the head of department of Physics in Air University?",
        "head of department of Physics?"
      ],
      "responses": [
        "Dr. Mozaffar Hussain is the head of department of Physics at air university."
      ]
    },
    {
      "tag": "teaching physics",
      "patterns": [
        "How much teaching staff is in department of Physics in Air university?",
        "teaching staff in department of Physics"
      ],
      "responses": [
        "The number of teaching staff at department of physics in air university Islamabad is 15. Physics among which 5 are lecturers and 10 doctorates assistant professors."
      ]
    },
    {
      "tag": "head maths",
      "patterns": [
        "Who is head of the department of mathematics in air university?",
        "head of the department of mathematics"
      ],
      "responses": [
        "Dr. shahid Mahmood is head of the department of mathematics in air university."
      ]
    },
    {
      "tag": "teaching maths",
      "patterns": [
        "How much teaching faculty is in department of mathematics in air university?",
        "teaching faculty is in department of mathematics"
      ],
      "responses": [
        "there are total 24 members of teaching staff in department of Mathematics."
      ]
    },
    {
      "tag": "programs maths",
      "patterns": [
        "Which programs are being offered in department of mathematics in air university?",
        "programs by department of mathematics",
        "programs by department of maths"
      ],
      "responses": [
        "Department of mathematics is offering BS, MS and PHD in Mathematics."
      ]
    },
    {
      "tag": "offer bs maths",
      "patterns": [
        "Is Air university offering BS in mathematics?",
        "Is Air university offering BS in maths?",
        "BS in mathematics?"
      ],
      "responses": [
        "Yes air university is offering BS Mathematics."
      ]
    },
    {
      "tag": "offer MS maths",
      "patterns": [
        "Is Air university offering MS in mathematics?",
        "Is Air university offering MS in maths?",
        "MS in mathematics?"
      ],
      "responses": [
        "Yes air university is offering MS Mathematics."
      ]
    },
    {
      "tag": "offer Phd maths",
      "patterns": [
        "Is Air university offering Phd in mathematics?",
        "Is Air university offering Phd in maths?",
        "Phd in mathematics?"
      ],
      "responses": [
        "Yes air university is offering Phd Mathematics."
      ]
    },
    {
      "tag": "duration BS maths",
      "patterns": [
        "What is the duration of BS mathematics in air university.",
        "duration of BS maths"
      ],
      "responses": [
        "Duration of BS mathematics program is 4 years."
      ]
    },
    {
      "tag": "credit hr bs maths",
      "patterns": [
        "How many credit hours are in BS mathematics in air university?",
        "credit hours of BS mathematics"
      ],
      "responses": [
        "There are total 134 credit hours in BS mathematics program in air university."
      ]
    },
    {
      "tag": "eligibilty BS Maths",
      "patterns": [
        "What is eligibility criteria for BS mathematics in air university?",
        "eligibility criteria for BS mathematics"
      ],
      "responses": [
        "FSc Pre-Engineering or ICS or Equivalent with Minimum 50 percent marks, then comes the entry test and at last the Interview."
      ]
    },
    {
      "tag": "duration MS maths",
      "patterns": [
        "What is duration of MS in mathematics in air university?",
        "duration of MS in mathematics",
        "duration of MS in maths"
      ],
      "responses": [
        "The duration of MS mathematics program is 2 years in air university."
      ]
    },
    {
      "tag": "credit hrs MS maths",
      "patterns": [
        "How many credit hours are in MS mathematics in air university?",
        "Credit hours of MS mathematics"
      ],
      "responses": [
        "There are total 30 credit hours in MS mathematics in air university."
      ]
    },
    {
      "tag": "eligibilty Ms maths",
      "patterns": [
        "What is eligibility criteria for MS mathematics in air university?",
        "eligibility criteria for MS mathematics"
      ],
      "responses": [
        "M.Sc Mathematics / BS Mathematics / BS Engineering from HEC recognized institute with minimum CGPA 2.50/4.00 or equivalent. GRE General /GAT General Test (at least 50 percent score) requires for admission in Master Program. Candidates will appear for an interview for the purpose of final selection."
        
      ]
    },
    {
      "tag": "duration phd maths",
      "patterns": [
        "What is duration of PHD in mathematics from air university?",
        "duration of PHD in mathematics",
        "duration of PHD in maths"
      ],
      "responses": [
        "The duration of PhD mathematics program from air university is about three to five years."
      ]
    },
    {
      "tag": "cedit hrs phd maths",
      "patterns": [
        "How many credit hours are in PhD mathematics program?",
        "credit hours of PhD mathematics?"
      ],
      "responses": [
        "There are total 48 credit hours PhD mathematics program."
      ]
    },
    {
      "tag": "eligibility phd maths",
      "patterns": [
        "What is eligibility criteria of PhD mathematics program in Air university?",
        "eligibility criteria of PhD mathematics",
        "eligibility criteria of PhD maths"
      ],
      "responses": [
        "18 years education in mathematics or related discipline, Minimum CGPA 3.0/4.0 or 75 percent marks. For award of PhD degree HEC requires GRE Mathematics test that must be taken before admission to PhD program. Candidates will have to appear in the interview for final selection."
      ]
    },
    {
      "tag": "courses maths",
      "patterns": [
        "Which courses are being offered in BS mathematics program in air university?",
        "courses offered in BS mathematics program",
        "courses offered in BS maths",
        "Which courses are being offered in MS mathematics program in air university?",
        "courses offered in MS mathematics program",
        "courses offered in MS maths",
        "Which courses are being offered in Phd mathematics program in air university?",
        "courses offered in Phd mathematics program",
        "courses offered in Phd maths"
      ],
      "responses": [
        "for this please visit air university official website."
      ]
    },
    {
      "tag": "bore",
      "patterns": [
        "I am getting bored",
        "bore"
      ],
      "responses": [
        "You can talk to me !",
        "How can I help you?"
      ]
    },
    {
      "tag": "name",
      "patterns": [
        "what is your name?",
        "To whom I am talking?",
        "what should I call you?"
      ],
      "responses": [
        "I am AU bot. I am here to help you to solve queries related to admission"
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "Could you help me?", 
        "give me a hand please", 
        "Can you help?", 
        "What can you do for me?", 
        "I need a support", 
        "I need a help", 
        "support me please"
      ],
      "responses": [
        "Tell me how can assist you", 
        "Tell me your problem to assist you", 
        "Yes Sure, How can I support you"
      ]
    },
    {
      "tag": "basic and applied sciences",
      "patterns": [ 
        "Is there faculty of basic and applied sciences in Air university?",
        "Is there faculty of applied sciences in Air university?",
        "Is there faculty of basic sciences in Air university?",
        "basic and applied sciences",
        "basic sciences",
        "applied sciences sciences"],
      "responses": [
        "Yes air university has faculty of basic and applied sciences , under which BS physics and BS mathematics programs are offered"
        
      ]
    },
    {
      "tag": "bs physics",
      "patterns": ["Does air university offer BS physics?",
                   "BS physics?",
                   "Is BS Physics program being offered by air university?"
                    ],
      "responses": [
        "Yes air university offers BS physics"
        
      ]
    },
    {
      "tag": "physics department",
      "patterns": ["Does air university have department of physics?",
                   "physics department?",
                   "department of physics?",
                   "Does air university have physics department?"
                    ],
      "responses": [
        "Yes air university has department of physics."
        
      ]
    },
    {
      "tag": "physics programs",
      "patterns": ["Which programs are offered by department of physics in air university?",
                   "physics programs",
                   "department of physics programs"
                    ],
      "responses": [
        "Air university is offering BS , MS and PhD programs in Physics department."
        
      ]
    },
    {
      "tag": "ms physics",
      "patterns": ["Is air university offering MS physics?",
                   "MS physics",
                   "Is MS Physics program being offered by air university?"
                    ],
      "responses": [
        "Yes Air university is offering MS physics program."
        
      ]
    },
    {
      "tag": "phd physics",
      "patterns": ["Is air university offering PhD physics?",
                   "phd physics",
                   "Is PhD Physics program being offered by air university?"
                    ],
      "responses": [
        "Yes Air university is offering PhD physics program."
        
      ]
    },
    {
      "tag": "bs physics duration",
      "patterns": ["What is duration of Bs Physics program in air university?",
                   "bs physics duration",
                   "duration of bachelors of physics",
                   "duration of BS physics"
                    ],
      "responses": [
        "The duration of BS physics program is four years."
        
      ]
    },
    {
      "tag": "ms physics duration",
      "patterns": ["What is duration of MS Physics program in air university?",
                   "ms physics duration",
                   "duration of masters of physics",
                   "duration of MS physics"
                    ],
      "responses": [
        "The duration of MS physics program is two years."
        
      ]
    },
    {
      "tag": "phd physics duration",
      "patterns": ["What is duration of PhD Physics program in air university?",
                   "phd physics duration",
                   "duration of doctorate of physics",
                   "duration of PhD physics"
                    ],
      "responses": [
        "The duration of PhD physics program is about three to five years."
        
      ]
    },
    {
      "tag": "credit hours bs physics",
      "patterns": ["How many credit hours are in BS physics program in air university?",
                   "credit hours of bs physics",
                   "bs physics credit hours",
                    "number of  credit hours in bs physics"
      ],
      "responses": [
        "There are total 133 one hundred and thirty-three credit hours in BS physics program."
        
      ]
    },
    {
      "tag": "credit hours ms physics",
      "patterns": ["How many credit hours are in MS physics program in air university?",
                   "credit hours of ms physics",
                   "ms physics credit hours",
                    "number of  credit hours in ms physics"
      ],
      "responses": [
        "There are total 30 credit hours in MS physics program."
        
      ]
    },
    {
      "tag": "credit hours of phd physics",
      "patterns": ["How many credit hours are in PhD physics program in air university?",
                   "credit hours of phd physics",
                   "phd physics credit hours",
                    "number of  credit hours in phd physics"
                    ],
      "responses": [
        "There are total 48 credit hours in PhD physics program."
        
      ]
    },
    {
      "tag": "eligibility criteria of bs physics",
      "patterns": ["What is eligibility criteria for BS physics in air university?",
                   "eligibility criteria of bs physics",
                   "bs physics eligibility criteria"
                    ],
      "responses": [
        "FSc Pre-Engineering or ICS or Equivalent with Minimum 50% marks and then comes the entry test and last the Interview."
        
      ]
    },
    {
      "tag": "eligibility criteria of ms physics",
      "patterns": ["What is eligibility criteria for MS physics in air university?",
                   "eligibility criteria of ms physics",
                   "ms physics eligibility criteria"
      ],
      "responses": [
        "M.Sc Physics / BS Physics / BS Engineering from HEC recognized institute with minimum CGPA 2.50/4.00 or equivalent. GRE General /GAT General Test (at least 50 percent score) requires for admission in Master Program. Candidates will appear for an interview for the purpose of final selection"
        
      ]
    },
    {
      "tag": "eligibility criteria of phd physics",
      "patterns": ["What is the eligibility criteria for PhD Physics from air university?",
                   "eligibility criteria of phd physics",
                   "phd physics eligibility criteria"
                                      ],
      "responses": [
        "M.Phil/MS in relevant field with CGPA 3.00/4.00 or equivalent. The candidate must have cleared GAT Subject Test (minimum 60% cumulative score) or a GRE Subject (International) Test (at least 50th percentile) before the date of admission in PhD Program. Candidates will appear for an interview for the purpose of final selection."
        
      ]
    },
    {
      "tag": "ms physics courses",
      "patterns": ["Which courses are being offered in MS physics program in air university?",
                   "ms physics courses",
                   "courses offered in ms physics",
                   "courses offered in masters of physics"
                                      ],
      "responses": [
        "For this please visit air university official website.",
         "visit air university official website."

        
      ]
    },
    {
      "tag": "bs physics courses",
      "patterns": ["Which courses are being offered in BS physics program in air university?",
                   "bs physics courses",
                   "courses offered in bs physics",
                   "courses offered in bachelors of physics"
                                      ],
      "responses": [
        "For this please visit air university official website.",
         "visit air university official website."

        
      ]
    },
    {
      "tag": "phd physics courses",
      "patterns": ["Which courses are being offered in phd physics program in air university?",
                   "phd physics courses",
                   "courses offered in phd physics",
                   "courses offered in doctorate of physics"
                                      ],
      "responses": [
        "For this please visit air university official website.",
         "visit air university official website."

        
      ]
    },
    {
      "tag": "timing of bs program",
      "patterns": ["What is the timing of BS program in air university?",
"What is the timing of bachelors program in air university?",
                   "timing of bs program",
                   "timing of bachelors program",
                   "BS program timing",
                   "BS classes timing"
                                      ],
      "responses": [
        "BS is an morning program; classes are conducted between 08:30 am to 05:30 pm"
          
      ]
    },
    {
      "tag": "timing of ms program",
      "patterns": ["What is the timing of MS program in air university?",
"What is the timing of masters program in air university?",
                   "timing of ms program",
                   "timing of masters program",
                   "MS program timing",
                   "MS classes timing"
                                      ],
      "responses": [
        "MS is an evening program; classes are conducted between 03:30-07:00 pm"
          
      ]
    },
    {
      "tag": "timing of phd program",
      "patterns": ["What is the timing of PhD program in air university?",
                   "What is the timing of doctorate program in air university?",
                   "timing of PhD program",
                   "timing of doctorate program",
                   "PhD program timing",
                   "PhD classes timing"
                                      ],
      "responses": [
        "PhD is an evening program; classes are conducted between 03:30-07:00 pm."
          
      ]
    },
    {
      "tag": "bs computer science program",
      "patterns": ["Is air university offering BS in computer science?",
                   "bs computer science program",
                   "IS Air university offering BSCS program",
                   "Is air university offering BSCS degree",
                   "is air university offering bachelors in computer science",
                   "bachelors in computer science"
                                      ],
      "responses": [
        "Yes Air university is offering Bs in computer science."
          
      ]
    },
    {
      "tag": "credit hours in BS computer science program",
      "patterns": ["How many credit hours are in BS computer science program in Air university?",
                   "credit hours in BS computer science program",
                   "number of credit hours in BSCS program",
                   "number of credit hours in BSCS degree",
                   "how many credit hours in bachelors of computer science",
                   "BSCS program total credit hours",
                   "How many credit hours are in BSCS program"
                                      ],
      "responses": [
        "there are total 135 credit hours in BS computer science program."
          
      ]
    },
    {
      "tag": "bs information technology program",
      "patterns": ["Is air university offering BS in Information technology?",
                   "bs Information technology program",
                   "IS Air university offering BSIT program",
                   "Is air university offering BSIT degree",
                   "is air university offering bachelors in Information technology",
                   "bachelors in Information technology"
                                      ],
      "responses": [
        "Yes Air university is offering Bs in Information technology."
          
      ]
    },
    {
      "tag": "credit hours in BS Information technology program",
      "patterns": ["How many credit hours are in BS Information technology program in Air university?",
                   "credit hours in BS Information technology program",
                   "number of credit hours in BSITprogram",
                   "number of credit hours in BSIT degree",
                   "how many credit hours in bachelors of Information technology",
                   "BSIT program total credit hours",
                   "How many credit hours are in BSIT program"
                                      ],
      "responses": [
        "there are total 132 credit hours in BS Information technology program."
          
      ]
    },
    {
      "tag": "ms information technology program",
      "patterns": ["Is air university offering MS in Information technology?",
                   "ms Information technology program",
                   "IS Air university offering MSIT program",
                   "Is air university offering MSIT degree",
                   "is air university offering masters in Information technology",
                   "masters in Information technology"
                                      ],
      "responses": [
        "No, air university is not offering MS in information technology."
          
      ]
    },
    {
      "tag": "phd information technology program",
      "patterns": ["Is air university offering PhD in information technology?",
                   "phd Information technology program",
                   "IS Air university offering PhD IT program",
                   "Is air university offering PhD IT degree",
                   "is air university offering doctorate in Information technology",
                   "doctorate in Information technology"
                                      ],
      "responses": [
        "No, air university is not offering PhD in information technology."
          
      ]
    },
    {
      "tag": "ms computer science",
      "patterns": ["Is air university offering MS in computer science?",
                   "ms computer science",
                   "IS Air university offering MSCS program",
                   "Is air university offering MSCSS degree",
                   "is air university offering masters in computer science",
                   "masters in computer science"
                                      ],
      "responses": [
        "Yes air university is offering MS in computer science."
          
      ]
    },
    {
      "tag": "credit hours in MS computer science program",
      "patterns": ["How many credit hours are in MS computer science program in Air university?",
                   "credit hours in MS computer science program",
                   "number of credit hours in MSCS program",
                   "number of credit hours in BMCS degree",
                   "how many credit hours in masters of computer science",
                   "MSCS program total credit hours",
                   "How many credit hours are in MSCS program"
                                      ],
      "responses": [
        "There are total 31 credit hours in MS computer science program."
          
      ]
    },
    {
      "tag": "phd computer science",
      "patterns": ["Is air university offering PhD in computer science?",
                   "phd computer science",
                   "IS Air university offering PhD CS program",
                   "Is air university offering PhD computer sccience degree",
                   "is air university offering doctorate in computer science",
                   "doctorate in computer science"
                                      ],
      "responses": [
        "Yes air university is offering PhD in computer science."
          
      ]
    },
    {
      "tag": "credit hours in PhD computer science program",
      "patterns": ["How many credit hours are in PhD computer science program in Air university?",
                   "credit hours in PhD computer science program",
                   "number of credit hours in PhDCS program",
                   "number of credit hours in PhD computer science degree",
                   "how many credit hours in doctoarte of computer science",
                   "PhD computer science program total credit hours",
                   "How many credit hours are in PhD computer science program"
                                      ],
      "responses": [
        "There are total 48 credit hours in PhD computer science program."
          
      ]
    },
    {
      "tag": "bs cyber security program",
      "patterns": ["Is air university offering BS in cyber security?",
                   "bs cyber security program",
                   "IS Air university offering BS cyber security program",
                   "Is air university offering BS cyber security degree",
                   "is air university offering bachelors in cyber security",
                   "bachelors in cyber security"
                                      ],
      "responses": [
        "Yes Air university is offering Bs in cyber security."
          
      ]
    },
    {
      "tag": "credit hours in BS cyber security program",
      "patterns": ["How many credit hours are in BS cyber security program in Air university?",
                   "credit hours in BS cyber security program",
                   "number of credit hours in BS cyber securityprogram",
                   "number of credit hours in BS cyber security degree",
                   "how many credit hours in bachelors of cyber security",
                   "BS cyber security program total credit hours",
                   "How many credit hours are in BS cyber security program"
                                      ],
      "responses": [
        "there are total 134 credit hours in BS cyber security program."
          
      ]
    },
    {
      "tag": "ms system security",
      "patterns": ["Is air university offering MS in system security?",
                   "ms system security",
                   "Is Air university offering MS system security program",
                   "Is air university offering MS system security degree",
                   "is air university offering masters in system security",
                   "masters in system security"
                                      ],
      "responses": [
        "Yes air university is offering MS in system security."
          
      ]
    },
    {
      "tag": "credit hours in MS system security program",
      "patterns": ["How many credit hours are in MS system security program in Air university?",
                   "credit hours in MS system security program",
                   "number of credit hours in MS system security program",
                   "number of credit hours in MS system security program degree",
                   "how many credit hours in masters of system security program",
                   "MS system security program total credit hours",
                   "How many credit hours are in MS system security p program"
                                      ],
      "responses": [
        "There are total 31 credit hours in MS system security program."
          
      ]
    },
    {
      "tag": "bs system security program",
      "patterns": ["Is air university offering BS in system security?",
                   "bs system security program",
                   "IS Air university offering BS system security program",
                   "Is air university offering BS system security degree",
                   "is air university offering bachelors in system security",
                   "bachelors in system security"
                                      ],
      "responses": [
        "No air university is not offering BS in system security."
          
      ]
    },
    {
      "tag": "phd system security",
      "patterns": ["Is air university offering PhD in system security?",
                   "phd system security",
                   "IS Air university offering PhD system security program",
                   "Is air university offering PhD system security degree",
                   "is air university offering doctorate in system security",
                   "doctorate in system security"
                                      ],
      "responses": [
        "No air university is not offering PhD in system security."
          
      ]
    },
    {
      "tag": "ms cyber security",
      "patterns": ["Is air university offering MS in cyber security?",
                   "ms cyber security",
                   "Is Air university offering MS cyber security program",
                   "Is air university offering MS cyber security degree",
                   "is air university offering masters in cyber security",
                   "masters in cyber security"
                                      ],
      "responses": [
        "Yes air university is offering MS in cyber security."
          
      ]
    },
    {
      "tag": "credit hours in MS cyber security program",
      "patterns": ["How many credit hours are in MS cyber security program in Air university?",
                   "credit hours in MS cyber security program",
                   "number of credit hours in MS cyber securityprogram",
                   "number of credit hours in MS cyber security degree",
                   "how many credit hours in masters of cyber security",
                   "MS cyber security program total credit hours",
                   "How many credit hours are in MS cyber security program"
                                      ],
      "responses": [
        "there are total 32 credit hours in MS cyber security program."
          
      ]
    },
    {
      "tag": "phd cyber security",
      "patterns": ["Is air university offering PhD in cyber security?",
                   "phd cyber security",
                   "IS Air university offering PhD cyber security program",
                   "Is air university offering PhD cyber security degree",
                   "is air university offering doctorate in cyber security",
                   "doctorate in cyber security"
                                      ],
      "responses": [
        "Yes air university is offering PhD in cyber security."
          
      ]
    },
    {
      "tag": "credit hours in PhD cyber security",
      "patterns": ["How many credit hours are in PhD cyber security program in Air university?",
                   "credit hours in PhD cyber security",
                   "number of credit hours in PhD cyber security program",
                   "number of credit hours in PhD cyber security degree",
                   "how many credit hours in doctoarte of cyber security",
                   "PhD cyber security program total credit hours",
                   "How many credit hours are in PhD cyber security program"
                                      ],
      "responses": [
        "There are total 48 credit hours in PhD cyber security program."
          
      ]
    },
    {
      "tag": "bs gaming and multimedia",
      "patterns": ["Is air university offering Bs in gaming and multimedia?",
                   "bs gaming and multimedia",
                   "IS Air university offering BS gaming and multimedia program",
                   "Is air university offering BS gaming and multimediadegree",
                   "is air university offering bachelors in gaming and multimedia",
                   "bachelors in gaming and multimedia"
                                      ],
      "responses": [
        "Yes air university is offering Bs in gaming and multimedia."
          
      ]
    },
    {
      "tag": "credit hours in BS gaming and multimedia",
      "patterns": ["How many credit hours are in BS gaming and multimedia program in Air university?",
                   "credit hours in BS gaming and multimedia ",
                   "number of credit hours in BS gaming and multimedia program",
                   "number of credit hours in BS gaming and multimedia degree",
                   "how many credit hours in bachelors of gaming and multimedia",
                   "BS gaming and multimedia program total credit hours",
                   "How many credit hours are in BS gaming and multimedia program"
                                      ],
      "responses": [
        "there are total 132 credit hours in Bs in gaming and multimedia program."
          
      ]
    },
    {
      "tag": "ms gaming and multimedia",
      "patterns": ["Is air university offering MS in gaming and multimedia?",
                   "ms gaming and multimedia",
                   "Is Air university offering MS gaming and multimedia program",
                   "Is air university offering MS gaming and multimedia degree",
                   "is air university offering masters in gaming and multimedia",
                   "masters in gaming and multimedia"
                                      ],
      "responses": [
        "No air university is not offering MS in gaming and multimedia."
          
      ]
    },
    {
      "tag": "phd in gaming and multimedia",
      "patterns": ["Is air university offering PhD in gaming and multimedia?",
                   "phd cyber security",
                   "IS Air university offering PhD gaming and multimedia program",
                   "Is air university offering PhD gaming and multimedia degree",
                   "is air university offering doctorate in gaming and multimedia",
                   "doctorate in gaming and multimedia"
                                      ],
      "responses": [
        "No air university is not offering PhD in gaming and multimedia."
          
      ]
    },
    {
      "tag": "bs software engineering",
      "patterns": ["Is air university offering Bs in software engineering?",
                   "bs software engineering",
                   "IS Air university offering BS software engineering program",
                   "Is air university offering BS software engineering degree",
                   "is air university offering bachelors in software engineering",
                   "bachelors in software engineering"
                                      ],
      "responses": [
        "Yes air university is offering Bs in software engineering."
          
      ]
    },
    {
      "tag": "credit hours in BS software engineering",
      "patterns": ["How many credit hours are in BS software engineering program in Air university?",
                   "credit hours in BS software engineering ",
                   "number of credit hours in BS software engineering program",
                   "number of credit hours in BS software engineering degree",
                   "how many credit hours in bachelors of software engineering",
                   "BS software engineering program total credit hours",
                   "How many credit hours are in BS software engineering program"
                                      ],
      "responses": [
        "there are total 131 credit hours in Bs in software engineering program."
          
      ]
    },
    {
      "tag": "ms software engineering",
      "patterns": ["Is air university offering MS in software engineering?",
                   "ms software engineering",
                   "Is Air university offering MS software engineering program",
                   "Is air university offering MS software engineering degree",
                   "is air university offering masters in software engineering",
                   "masters in software engineering"
                                      ],
      "responses": [
        "No air university is not offering MS in software engineering."
          
      ]
    },
    {
      "tag": "phd in software engineering",
      "patterns": ["Is air university offering PhD in software engineering?",
                   "phd software engineering",
                   "IS Air university offering PhD in software engineering program",
                   "Is air university offering PhD software engineering degree",
                   "is air university offering doctorate in software engineering",
                   "doctorate in software engineering"
                                      ],
      "responses": [
        "No air university is not offering PhD in software engineering."
          
      ]
    },
    {
      "tag": "bs artificial intelligence",
      "patterns": ["Is air university offering Bs in artificial intelligence?",
                   "bs artificial intelligence",
                   "IS Air university offering BS artificial intelligence",
                   "Is air university offering BS artificial intelligence degree",
                   "is air university offering bachelors in artificial intelligence",
                   "bachelors in artificial intelligence"
                                      ],
      "responses": [
        "Yes air university is offering Bs in artificial intelligence."
          
      ]
    },
    {
      "tag": "credit hours in BS artificial intelligence",
      "patterns": ["How many credit hours are in BS artificial intelligenceprogram in Air university?",
                   "credit hours in BS artificial intelligence ",
                   "number of credit hours in BS artificial intelligence program",
                   "number of credit hours in BS artificial intelligence degree",
                   "how many credit hours in bachelors of artificial intelligence",
                   "BS artificial intelligence program total credit hours",
                   "How many credit hours are in BS artificial intelligence program"
                                      ],
      "responses": [
        "there are total 136 credit hours in Bs in artificial intelligence program."
          
      ]
    },
    {
      "tag": "ms artificial intelligence",
      "patterns": ["Is air university offering MS in artificial intelligence?",
                   "ms artificial intelligence",
                   "Is Air university offering MS artificial intelligence program",
                   "Is air university offering MS artificial intelligence degree",
                   "is air university offering masters in artificial intelligence",
                   "masters in artificial intelligence"
                                      ],
      "responses": [
        "Yes air university is offering MS in artificial intelligence."
          
      ]
    },
    {
          "tag": "credit hours in MS artificial intelligence",
      "patterns": ["How many credit hours are in MS artificial intelligence program in Air university?",
                   "credit hours in MS artificial intelligence program",
                   "number of credit hours in MS artificial intelligence program",
                   "number of credit hours in MS artificial intelligence degree",
                   "how many credit hours in masters of artificial intelligence",
                   "MS artificial intelligence program total credit hours",
                   "How many credit hours are in MS artificial intelligence program"
                                      ],
      "responses": [
        "there are total 31 credit hours in MS artificial intelligence program."
          
      ]
    },
    {
      "tag": "phd in artificial intelligence",
      "patterns": ["Is air university offering PhD in artificial intelligence?",
                   "phd artificial intelligence",
                   "IS Air university offering PhD in artificial intelligence program",
                   "Is air university offering PhD artificial intelligence degree",
                   "is air university offering doctorate in artificial intelligence",
                   "doctorate in artificial intelligence"
                                      ],
      "responses": [
        "No air university is not offering PhD in artificial intelligence."
          
      ]
    },
    {
      "tag": "bs data science",
      "patterns": ["Is air university offering Bs in data science?",
                   "bs data science",
                   "IS Air university offering BS in data science",
                   "Is air university offering BS data science degree",
                   "is air university offering bachelors in data science",
                   "bachelors in data science"
                                      ],
      "responses": [
        "No, air university is not offering BS in data science."
          
      ]
    },
    {
      "tag": "ms data science",
      "patterns": ["Is air university offering MS in data science?",
                   "ms data science",
                   "Is Air university offering MS data science program",
                   "Is air university offering MS data science degree",
                   "is air university offering masters in data science",
                   "masters in data science"
                                      ],
      "responses": [
        "Yes air university is offering MS in data science."
          
      ]
    },
    {
      "tag": "credit hours in MS data science program",
      "patterns": ["How many credit hours are in MS data science program in Air university?",
                   "credit hours in MS data science program",
                   "number of credit hours in MS data science program",
                   "number of credit hours in MS data science degree",
                   "how many credit hours in masters of data science",
                   "MS data science program total credit hours",
                   "How many credit hours are in MS data science program"
                                      ],
      "responses": [
        "there are total 31 credit hours in MS data science program."
          
      ]
    },
    {
      "tag": "phd in data science",
      "patterns": ["Is air university offering PhD in data science?",
                   "phd data science",
                   "IS Air university offering PhD in data science program",
                   "Is air university offering PhD data science degree",
                   "is air university offering doctorate in data science",
                   "doctorate in data science"
                                      ],
      "responses": [
        "No air university is not offering PhD in data science."
          
      ]
    },
    {
      "tag": "computer science faculty",
      "patterns": ["How many faculty members are in Computer science department?",
                   "How many faculty members are in CS department?",
                   "computer science faculty",
                   "How many teachers are in CS department",
                   "How many teachers are in Computer science department"
                                      ],
      "responses": [
       "There are 33 faculty members in computer science department."
          
      ]
    },
    {
      "tag": "computer science doctorates",
      "patterns": ["How many doctorates are in Computer science department?",
                   "How many doctorates are in CS department?",
                   "computer science doctorates"
                                      ],
      "responses": [
        "There are 10 doctorates in computer science department."

          
      ]
    },
    {
      "tag": "computer science lab engineers",
      "patterns": ["How many lab engineers are in Computer science department?",
                   "How many lab engineers are in CS department?",
                   "computer science lab engineers"
                                      ],
      "responses": [
        "there are 3 lab engineers in computer science department. Usually the course lecturer his self takes the lab of that course."
          
      ]
    },
    {
      "tag": "computer science lecturers",
      "patterns": ["How many lecturers are in Computer science department?",
                   "How many lecturers are in CS department?",
                   "computer science lecturers"
                                      ],
      "responses": [
        "There are 19 lecturers and 11 assistant professors in computer science department."
          
      ]
    },
    {
      "tag": "information technology faculty",
      "patterns": ["How many faculty members are in information technology department?",
                   "How many faculty members are in IT department?",
                   "information technology faculty",
                   "How many teachers are in IT department",
                   "How many teachers are in information technology department"
                                      ],
      "responses": [
       "There are 33 faculty members in information technology department."
          
      ]
    },
    {
      "tag": "information technology doctorates",
      "patterns": ["How many doctorates are in information technology department?",
                   "How many doctorates are in IT department?",
                   "information technology doctorates"
                                      ],
      "responses": [
        "There are 10 doctorates in information technology department."

          
      ]
    },
    {
      "tag": "information technology lab engineers",
      "patterns": ["How many lab engineers are in information technology department?",
                   "How many lab engineers are in IT department?",
                   "information technology lab engineers"
                                      ],
      "responses": [
        "there are 3 lab engineers in information technology department. Usually the course lecturer his self takes the lab of that course."
          
      ]
    },
    {
      "tag": "information technology lecturers",
      "patterns": ["How many lecturers are in information technology department?",
                   "How many lecturers are in IT department?",
                   "information technology lecturers"
                                      ],
      "responses": [
        "There are 19 lecturers and 11 assistant professors in information technology department."
          
      ]
    },
    {
      "tag": "cyber security faculty",
      "patterns": ["How many faculty members are in cyber security department?",
          
                   "cyber security faculty",
                   "How many teachers are in cyber security department"
                                      ],
      "responses": [
       "There are 18 faculty members in cyber security department."
          
      ]
    },
    {
      "tag": "cyber security doctorates",
      "patterns": ["How many doctorates are in cyber security department?",
                   
                   "cyber security doctorates"
                                      ],
      "responses": [
        "There are 7 doctorates in cyber security department.."

          
      ]
    },
    {
      "tag": "cyber security lab engineers",
      "patterns": ["How many lab engineers are in cyber security department?",
                   
                   "cyber security lab engineers"
                                      ],
      "responses": [
        "there are 3 lab engineers in cyber security department. Usually the course lecturer his self takes the lab of that course."
          
      ]
    },
    {
      "tag": "cyber security lecturers",
      "patterns": ["How many lecturers are in cyber security department?",
                   
                   "cyber security lecturers"
                                      ],
      "responses": [
        "There are 8 lecturers and 7 assistant professors in cyber security department."
          
      ]
    },
    {
      "tag": "creative technologies faculty",
      "patterns": ["How many faculty members are in creative technologies department?",
          
                   "creative technologies faculty",
                   "How many teachers are in creative technologies department"
                                      ],
      "responses": [
       "There are 21 faculty members in creative technologies department."
          
      ]
    },
    {
      "tag": "creative technologies doctorates",
      "patterns": ["How many doctorates are in creative technologies department?",
                   
                   "creative technologies doctorates"
                                      ],
      "responses": [
        "There are 9 doctorates in creative technologies department."

          
      ]
    },
    {
      "tag": "creative technologies lab engineers",
      "patterns": ["How many lab engineers are in creative technologies department?",
                   
                   "creative technologies lab engineers"
                                      ],
      "responses": [
        "there are 2 lab engineers in creative technologies department. Usually the course lecturer his self takes the lab of that course."
          
      ]
    },
    {
      "tag": "creative technologies lecturers",
      "patterns": ["How many lecturers are in creative technologies department?",
                   
                   "creative technologies lecturers"
                                      ],
      "responses": [
        "There are 10 lecturers and 9 assistant professors in creative technologies department."
          
      ]
    },
    {
      "tag": " gaming and multimedia  faculty",
      "patterns": ["How many faculty members are in  gaming and multimedia  department?",
          
                   " gaming and multimedia  faculty",
                   "How many teachers are in  gaming and multimedia  department"
                                      ],
      "responses": [
       "There are 21 faculty members in  gaming and multimedia  department."
          
      ]
    },
    {
      "tag": " gaming and multimedia  doctorates",
      "patterns": ["How many doctorates are in  gaming and multimedia  department?",
                   
                   " gaming and multimedia  doctorates"
                                      ],
      "responses": [
        "There are 9 doctorates in gaming and multimedia department."

          
      ]
    },
    {
      "tag": " gaming and multimedia  lab engineers",
      "patterns": ["How many lab engineers are in  gaming and multimedia  department?",
                   
                   " gaming and multimedia  lab engineers"
                                      ],
      "responses": [
        "there are 2 lab engineers in gaming and multimedia department. Usually the course lecturer his self takes the lab of that course."
          
      ]
    },
    {
      "tag": " gaming and multimedia  lecturers",
      "patterns": ["How many lecturers are in  gaming and multimedia  department?",
                   
                   " gaming and multimedia lecturers"
                                      ],
      "responses": [
        "There are 10 lecturers and 9 assistant professors in gaming and multimedia department."
          
      ]
    },
    {
      "tag": " software engineering  faculty",
      "patterns": ["How many faculty members are in  software engineering  department?",
          
                   " software engineering  faculty",
                   "How many teachers are in  software engineering  department"
                                      ],
      "responses": [
       "There are 21 faculty members in  software engineering  department."
          
      ]
    },
    {
      "tag": " software engineering  doctorates",
      "patterns": ["How many doctorates are in  software engineering  department?",
                   
                   " software engineering  doctorates"
                                      ],
      "responses": [
        "There are 9 doctorates in software engineering department."

          
      ]
    },
    {
      "tag": " software engineering  lab engineers",
      "patterns": ["How many lab engineers are in  software engineering  department?",
                   
                   " software engineering  lab engineers"
                                      ],
      "responses": [
        "there are 2 lab engineers in software engineering department. Usually the course lecturer his self takes the lab of that course."
          
      ]
    },
    {
      "tag": " software engineering  lecturers",
      "patterns": ["How many lecturers are in  software engineering  department?",
                   
                   " software engineering lecturers"
                                      ],
      "responses": [
        "There are 10 lecturers and 9 assistant professors in software engineering department."
          
      ]
    },
    {
      "tag": " artificial intelligence  faculty",
      "patterns": ["How many faculty members are in  artificial intelligence  department?",
          
                   " artificial intelligence  faculty",
                   "How many teachers are in  artificial intelligence department"
                                      ],
      "responses": [
       "There are 21 faculty members in  artificial intelligence  department."
          
      ]
    },
    {
      "tag": " artificial intelligence  doctorates",
      "patterns": ["How many doctorates are in  artificial intelligence  department?",
                   
                   " artificial intelligence  doctorates"
                                      ],
      "responses": [
        "There are 9 doctorates in artificial intelligence department."

          
      ]
    },
    {
      "tag": " artificial intelligence  lab engineers",
      "patterns": ["How many lab engineers are in  artificial intelligence  department?",
                   
                   " artificial intelligence  lab engineers"
                                      ],
      "responses": [
        "there are 2 lab engineers in artificial intelligence department. Usually the course lecturer his self takes the lab of that course."
          
      ]
    },
    {
      "tag": " artificial intelligence  lecturers",
      "patterns": ["How many lecturers are in  artificial intelligence  department?",
                   
                   " artificial intelligence lecturers"
                                      ],
      "responses": [
        "There are 10 lecturers and 9 assistant professors in artificial intelligence department."
          
      ]
    },  
    {
      "tag": " computer science research work",
      "patterns": ["Is there any research work being done in computer science department of air university?",
                   
                   "computer science research work"
                                      ],
      "responses": [
        "yes air university's computer science department is conducting research and development activities."
          
      ]
    }, 
    {
      "tag": " computer science research areas",
      "patterns": ["How many research areas are in computer science department of air university?",
                   
                   "computer science research areas"
                                      ],
      "responses": [
        "Currently research work is being done in 5 areas. For more information visit air university website."
          
      ]
    }, 
    {
      "tag": " computer science labs",
      "patterns": ["Are there any labs in computer science department?",
                    "Are there any labs in CS department?",
                   "computer science labs",
                    "CS labs",
                   "Number of labs in computer science department?",
                   "labs in computer science department?",
                   "labs in CS department?"
                                      ],
      "responses": [
        "Yes there are more than 10 labs in computer science department. For more information visit air university website."
          
      ]
    }, 
    {
      "tag": " cyber security labs",
      "patterns": ["Are there any labs in cyber security department?",
                    
                   "cyber security labs",
                    
                   "Number of labs in cyber security department?",
                   "labs in cyber security department?"
                   
                                      ],
      "responses": [
        "Yes there are more than 10 labs in cyber security department. For more information visit air university website."
          
      ]
    }, 
    {
      "tag": " creative technologies labs",
      "patterns": ["Are there any labs in creative technologies department?",
                    
                   "creative technologies labs",
                    
                   "Number of labs in creative technologies department?",
                   "labs in creative technologies department?"
                   
                                      ],
      "responses": [
        "Yes there are more than 10 labs in creative technologies department. For more information visit air university website."
          
      ]
    }, 
    {
      "tag": " software engineering labs",
      "patterns": ["Are there any labs in software engineering department?",
                    
                   "software engineering labs",
                    
                   "Number of labs in software engineering department?",
                   "labs in software engineering department?"
                   
                                      ],
      "responses": [
        "Yes there are more than 10 labs in software engineering department. For more information visit air university website."
          
      ]
    }, 
    {
      "tag": " artificial intelligence labs",
      "patterns": ["Are there any labs in artificial intelligence department?",
                    
                   "artificial intelligence labs",
                    
                   "Number of labs in artificial intelligence department?",
                   "labs in artificial intelligence department?"
                   
                                      ],
      "responses": [
        "Yes there are more than 10 labs in artificial intelligence department. For more information visit air university website."
          
      ]
    }, 
    {
      "tag": " gaming and multimedia labs",
      "patterns": ["Are there any labs in gaming and multimedia department?",
                    
                   "gaming and multimedia labs",
                    
                   "Number of labs in gaming and multimedia department?",
                   "labs in gaming and multimedia department?"
                   
                                      ],
      "responses": [
        "Yes there are more than 10 labs in gaming and multimedia department. For more information visit air university website."
          
      ]
    }, 
    {
      "tag": " data science labs",
      "patterns": ["Are there any labs in data science department?",
                    
                   "data science labs",
                    
                   "Number of labs in data science department?",
                   "labs in data science department?"
                   
                                      ],
      "responses": [
        "Yes there are more than 10 labs in data science department. For more information visit air university website."
          
      ]
    }, 
    {
      "tag": " system security labs",
      "patterns": ["Are there any labs in system security department?",
                    
                   "system security labs",
                    
                   "Number of labs in system security department?",
                   "labs in system security department?"
                  
                                      ],
      "responses": [
        "Yes there are more than 10 labs in system security department. For more information visit air university website."
          
      ]
    }, 
    {
      "tag": " information technology labs",
      "patterns": ["Are there any labs in information technology department?",
                    "Are there any labs in IT department?",
                    "IT labs",
                   "information technology labs",
                    "Number of labs in IT department?",
                   "Number of labs in information technology department?",
                   "labs in information technology department?",
                    "labs in IT department?"
                   
                                      ],
      "responses": [
        "Yes there are more than 10 labs in information technology department. For more information visit air university website."
          
      ]
    }, 
    {
      "tag": " institutes affiliated",
      "patterns": ["Are there any institutes affiliated from air university?",
                     "which institutes are affiliated from air university?",
                     "institutes affiliated",
                     "institutes affiliated form Air university" 
                  ],
      "responses": [
        "There are 5 institutes affiliated from air university.Bilquis college of education for women Chaklala rwp, fazaia college of education for women Lahore, aero medical institute paf base masroor karachi, college of education Peshawar and college of education for women Peshawar."   
      ]
    }, 
    {
      "tag": " library service hours",
      "patterns": ["What are library service hours?",
                    "library service hours"
                  ],
      "responses": [
        "8:30 am to 18.00 Monday through Friday. Except Saturday, Sundays &amp; Gazette holidays."   
      ]
    }, 
    {
      "tag": "research labs",
      "patterns": ["How many research labs are in air university?",
                     "Are there any research labs in air university?",
                     "Which research labs are in air university?",
                    "research labs"
                  ],
      "responses": [
        "Air university has about 23 research labs.For more information please visit air university website."   
      ]
    },
    {
      "tag": "bus service",
      "patterns": ["Does air university provide bus service for its students.",
                    "bus service"
                  ],
      "responses": [
        "Yes air university provides bus service for all of its students with Islamabad."   
      ]
    },
    {
      "tag": "girls common room",
      "patterns": ["Is there any girls common room in air university?",
                    "girls common room"
                  ],
      "responses": [
        "Yes there are 5 common rooms for girls in air university."   
      ]
    },
    {
      "tag": "grounds",
      "patterns": ["How many grounds are in air university?",
                    "grounds"
                  ],
      "responses": [
        "Air university has 6 grounds."   
      ]
    },
    {
      "tag": "gym",
      "patterns": ["Is there any gym in air university?",
                    "gym"
                  ],
      "responses": [
        "yes air university has gym for both girls and boys."   
      ]
    },
    {
      "tag": "electrical engineering hod",
      "patterns": ["Who is Hod of department of electrical engineering in air university?",
                    "electrical engineering hod"
                  ],
      "responses": [
        "Currently Dr Waseem is serving as chair department of electrical engineering department."   
      ]
    },
    {
      "tag": "courses taught in CS",
      "patterns": ["Which courses are taught or offered in computer science department?",
                   "courses taught in CS",
                   "courses offered for CS"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in IT",
      "patterns": ["Which courses are taught or offered in BS information technology department?",
                   "courses taught in IT",
                   "courses offered for IT"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in MS CS",
      "patterns": ["Which courses are taught or offered in MS computer Science department?",
                   "courses taught in MSCS",
                   "courses offered for MSCS"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in PhD",
      "patterns": ["Which courses are taught or offered in PhD computer Science department?",
                   "courses taught in PhD",
                   "courses offered for PhD"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in cyber security",
      "patterns": ["Which courses are taught or offered in cyber security department?",
                   "courses taught in cyber security",
                   "courses offered for cyber security"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in system security",
      "patterns": ["Which courses are taught or offered in system security department?",
                   "courses taught in system security",
                   "courses offered for system security"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in BS Cyber security",
      "patterns": ["Which courses are taught or offered in BS Cyber security department?",
                   "courses taught in BS Cyber security",
                   "courses offered for BS Cyber security"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in MS cyber security",
      "patterns": ["Which courses are taught or offered in MS cyber security department?",
                   "courses taught in MS cyber security",
                   "courses offered for MS cyber security"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in PhD cyber security",
      "patterns": ["Which courses are taught or offered in PhD cyber security department?",
                   "courses taught in PhD cyber security",
                   "courses offered for PhD cyber security"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in creative technologies",
      "patterns": ["Which courses are taught or offered in creative technologies department?",
                   "courses taught in creative technologies",
                   "courses offered for creative technologies"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in gaming and multimedia",
      "patterns": ["Which courses are taught or offered in gaming and multimedia department?",
                   "courses taught in gaming and multimedia",
                   "courses offered for gaming and multimedia"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in Software engineering",
      "patterns": ["Which courses are taught or offered in Software engineering department?",
                   "courses taught in Software engineering",
                   "courses offered for Software engineering"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in artificial intelligence",
      "patterns": ["Which courses are taught or offered in artificial intelligence department?",
                   "courses taught in artificial intelligence",
                   "courses offered for artificial intelligence"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in data science",
      "patterns": ["Which courses are taught or offered in data science department?",
                   "courses taught in data science",
                   "courses offered for data science"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in BS artificial intelligence",
      "patterns": ["Which courses are taught or offered in BS artificial intelligence program?",
                   "courses taught in BS artificial intelligence",
                   "courses offered for BS artificial intelligence"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in MS artificial intelligence",
      "patterns": ["Which courses are taught or offered in MS artificial intelligence program?",
                   "courses taught in MS artificial intelligence",
                   "courses offered for MS artificial intelligence"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in BS Software engineering",
      "patterns": ["Which courses are taught or offered in BS Software engineering program?",
                   "courses taught in BS Software engineering",
                   "courses offered for BS Software engineering"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },
    {
      "tag": "courses taught in MS data science",
      "patterns": ["Which courses are taught or offered in MS data science program?",
                   "courses taught in MS data science",
                   "courses offered for MS data science"
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
    },  
    {
      "tag": "research work in Cyber security",
      "patterns": ["Is there any research work being done in cyber security department of air university?",
                   "research work in Cyber security",
                   "research work for Cyber security"
                    ],
      "responses": [
        "Yes air university's cyber security department is conducting research and development activities."
        
      ]
    },
    {
      "tag": "research areas in Cyber security",
      "patterns": ["How many research areas are in cyber security department of air university?",
                   "research areas in Cyber security",
                   "research areas for Cyber security"
                    ],
      "responses": [
        "Currently research work is being done in 5 areas. For more information visit air university website."
        
      ]
    },
    {
      "tag": "research work in creative tech",
      "patterns": ["Is there any research work being done in creative technologies department of air university?",
                   "research work in creative tech",
                   "research work for creative tech"
                    ],
      "responses": [
        "Yes air university's creative technologies department is conducting research and development activities."
        
      ]
    },
    {
      "tag": "research areas in cyber security",
      "patterns": ["How many research areas are in cyber security department of air university?",
                   "research areas in cyber security",
                   "research areas for cyber security"
                    ],
      "responses": [
        "Visit Air university website for more information."
        
      ]
    },
    {
      "tag": " research work in gaming and multimedia",
      "patterns": ["Is there any research work being done in gaming and multimedia department of air university?",
                   "research work in gaming and multimedia",
                   "research work for gaming and multimedia"
                    ],
      "responses": [
        "Yes air university's gaming and multimedia department is conducting research and development activities."
        
      ]
    },
    {
      "tag": " research areas in gaming and multimedia",
      "patterns": ["How many research areas are in gaming and multimedia department of air university?",
                   "research areas in gaming and multimedia",
                   "research areas for gaming and multimedia"
                    ],
      "responses": [
        "Visit Air university website for more information."
        
      ]
    },
    {
      "tag": " research work in software engineering",
      "patterns": ["Is there any research work being done in software engineering department of air university?",
                   "research work in software engineering",
                   "research work for software engineering"
                    ],
      "responses": [
        "Yes air university's software engineering department is conducting research and development activities."
        
      ]
    },
    {
      "tag": " research Areas in software engineering",
      "patterns": ["How many research areas are in software engineering department of air university?",
                   "research areas in software engineering",
                   "research areas for software engineering"
                    ],
      "responses": [
        "Visit Air university website for more information."
        
      ]
    },
    {
      "tag": " research work in AI",
      "patterns": ["Is there any research work being done in artificial intelligence department of air university?",
                   "research work in AI",
                   "research work for AI"
                    ],
      "responses": [
        "Yes air university's artificial intelligence department is conducting research and development activities."
        
      ]
    },
    {
      "tag": " research work in data science",
      "patterns": ["Is there any research work being done in data science department of air university?",
                   "research work in data science",
                   "research work in data science"
                    ],
      "responses": [
        "Yes air university's data science department is conducting research and development activities."
        
      ]
    },
    {
      "tag": " research areas in data science department",
      "patterns": ["How many research areas are in data science department of air university?",
                   "research areas in data science",
                   "research areas for data science"
                    ],
      "responses": [
        "Visit Air university website for more information."
        
      ]
    },
    {
      "tag": " research work in system security department",
      "patterns": ["Is there any research work being done in system security department of air university?",
                   "research work in system security department",
                   "research work for system security department"
                    ],
      "responses": [
        "Yes air university's system security department is conducting research and development activities."
        
      ]
    },
    {
      "tag": " research areas in system security department",
      "patterns": ["How many research areas are in system security department of air university?",
                   "research areas in system security department",
                   "research areas for system security department"
                    ],
      "responses": [
        "Visit Air university website for more information."
        
      ]
    },
    {
      "tag": " research work in IT department",
      "patterns": ["Is there any research work being done in information technology department of air university?",
                   "research work in IT department",
                   "research work for IT department"
                    ],
      "responses": [
        "Yes air university's information technology department is conducting research and development activities."
        
      ]
    },
    {
      "tag": " research areas in IT department",
      "patterns": ["How many research areas are in information technology department of air university?",
                   "research areas in IT department",
                   "research areas for IT department"
                    ],
      "responses": [
        "Visit Air university website for more information."
        
      ]
    },
    {
      "tag": " programs offered in electrical engineering ",
      "patterns": ["which programs are offered in electrical engineering department in air university?",
                   " programs offered in electrical engineering "
                    ],
      "responses": [
        " Air university electrical engineering department is offering bachelors in electrical engineering, masters in electrical engineering and phd in electrical engineering."
        
      ]
    },
    {
      "tag": " programs offered in computer engineering ",
      "patterns": ["Which programs are offered in computer engineering department in air university?",
                   " programs offered in computer engineering "
                    ],
      "responses": [
        " Air university computer engineering department is offering bachelors in computer engineering, masters in computer engineering and phd in computer engineering."
        
      ]
    },
    {
      "tag": " bachelors in electrical engineering ",
      "patterns": ["Is air university offering bachelors in electrical engineering?",
                   " bachelors in electrical engineering "
                    ],
      "responses": [
        " Yes air university is offering bachelors degree in electrical engineering."
        
      ]
    },
    {
      "tag": " BS in electrical engineering ",
      "patterns": ["Is air university offering BS in electrical engineering? ",
                   " BS in electrical engineering "
                    ],
      "responses": [
        " Yes air university is offering BS in electrical engineering. "
        
      ]
    },
    {
      "tag": " duration of Bs electrical engineering ",
      "patterns": ["What is the duration of Bs electrical engineering in air university? ",
                   " duration of Bs electrical engineering "
                    ],
      "responses": [
        " The duration of BS electrical engineering in air university is 4 to 6 years."
        
      ]
    },
    {
      "tag": " credit hours in Bs electrical engineering ",
      "patterns": ["How many credit hours are in Bs electrical engineering in air university? ",
                   " credit hours in Bs electrical engineering "
                    ],
      "responses": [
        " There are total 139 credit hours in BS electrical engineering."
        
      ]
    },
    {
      "tag": " areas in which air university is offering BS electrical engineering ",
      "patterns": ["In which areas air university is offering BS electrical engineering? ",
                   " areas in which air university is offering BS electrical engineering "
                    ],
      "responses": [
        " Air university is offering BSEE in 3 main areas. Electronics , telecommunications and power engineering "
        
      ]
    },
    {
      "tag": " eligibility criteria for BS electrical engineering ",
      "patterns": ["What is eligibility criteria for BS electrical engineering in air university? ",
                   " eligibility criteria for BS electrical engineering "
                    ],
      "responses": [
        " Applicants should have at least 60 percent marks in F.Sc. A-Level or equivalent. Must passed Entry Test and at last qualify in Interview."
        
      ]
    },
    {
      "tag": " bachelors in computer engineering ",
      "patterns": ["Is air university offering bachelors in computer engineering? ",
                   " bachelors in computer engineering "
                    ],
      "responses": [
        " Yes air university is offering bachelors degree in computer engineering."
        
      ]
    },
    {
      "tag": " BS in computer engineering ",
      "patterns": ["Is air university offering BS in computer engineering? ",
                   " BS in computer engineering "
                    ],
      "responses": [
        " yes air university is offering BS in computer engineering."
        
      ]
    },
    {
      "tag": " duration of Bs computer engineering ",
      "patterns": ["What is the duration of Bs computer engineering in air university? ",
                   " duration of Bs computer engineering "
                    ],
      "responses": [
        " the duration of BS computer engineering in air university is 4 to 6 years."
        
      ]
    },
    {
      "tag": " credit hours in Bs computer engineering ",
      "patterns": ["How many credit hours are in Bs computer engineering in air university? ",
                   " credit hours in Bs computer engineering "
                    ],
      "responses": [
        " There are total 139 credit hours in BS computer engineering."
        
      ]
    },
    {
      "tag": " eligibility criteria for BS computer engineering ",
      "patterns": ["What is eligibility criteria for BS computer engineering in air university? ",
                   " eligibility criteria for BS computer engineering "
                    ],
      "responses": [
        " Applicants should have at least 60 percent marks in F.Sc. A-Level or equivalent. Must passed Entry Test and at last qualify in Interview."
        
      ]
    },
    {
      "tag": " masters in electrical engineering ",
      "patterns": ["Is air university offering masters in electrical engineering? ",
                   " masters in electrical engineering "
                    ],
      "responses": [
        " Yes air university is offering masters degree in electrical engineering."
        
      ]
    },
    {
      "tag": " MS in electrical engineering ",
      "patterns": ["Is air university offering MS in electrical engineering? ",
                   " MS in electrical engineering "
                    ],
      "responses": [
        " yes air university is offering MS in electrical engineering."
        
      ]
    },
    {
      "tag": " duration of MS electrical engineering ",
      "patterns": ["What is the duration of MS electrical engineering in air university? ",
                   " duration of MS electrical engineering "
                    ],
      "responses": [
        " The duration of MS electrical engineering in air university is 2 years."
        
      ]
    },
    {
      "tag": " credit hours in MS electrical engineering ",
      "patterns": ["How many credit hours are in MS electrical engineering in air university? ",
                   " credit hours in MS electrical engineering "
                    ],
      "responses": [
        " There are total 30 credit hours in MS electrical engineering."
        
      ]
    },
    {
      "tag": " eligibility criteria for MS electrical engineering ",
      "patterns": ["What is eligibility criteria for MS electrical engineering in air university? ",
                   " eligibility criteria for MS electrical engineering "
                    ],
      "responses": [
        " Minimum 60 percent or 2.50/4.00 GPA in BE/BSc (Electrical/Electronics,/Avionics/Telecommunications/Computer Engineering)GRE (General) /GAT conducted by NTS min 50 percent."
        
      ]
    },
    {
      "tag": " PhD in electrical engineering ",
      "patterns": ["Is air university offering PhD in electrical engineering? ",
                   " PhD in electrical engineering "
                    ],
      "responses": [
        " Yes air university is offering PhD degree in electrical engineering."
        
      ]
    },
    
    {
      "tag": " doctorate in electrical engineering ",
      "patterns": ["Is air university offering doctorate in electrical engineering? ",
                   " doctorate in electrical engineering "
                    ],
      "responses": [
        " Yes air university is offering doctorate in electrical engineering."
        
      ]
    },
    {
      "tag": " duration of PhD electrical engineering ",
      "patterns": ["What is the duration of PhD electrical engineering in air university? ",
                   " duration of PhD electrical engineering "
                    ],
      "responses": [
        " The duration of PhD electrical engineering in air university is Maximum 04 years after MS (Extendable by two years)."
        
      ]
    },
    {
      "tag": " credit hours in PhD electrical engineering ",
      "patterns": ["How many credit hours are in PhD electrical engineering in air university? ",
                   " credit hours in PhD electrical engineering "
                    ],
      "responses": [
        " There are total 48 among which 18 Credit Hours of Course work, 30 Credit Hours of dissertation work) in PhD electrical engineering."
        
      ]
    },
    {
      "tag": " eligibility criteria for PhD electrical engineering ",
      "patterns": ["What is eligibility criteria for PhD electrical engineering in air university? ",

                   " eligibility criteria for PhD electrical engineering "
                    ],
      "responses": [
        " Masters/ M Phil degree in relevant area with a minimum 300/400 or equivalent Passing GRE (subject) or GAT(subject) by NTS with at least 60 percent mark."
        
      ]
    },
    {
      "tag": "HoD of computer engineering",
      "patterns": ["who is HoD of computer engineering department in air university?", "HoD of computer engineering"
            
                    ],
      "responses": [
        "Dr. Waseem Khan is HOD of computer engineering department in air university."
        
      ]
    },
    {
       "tag": "HoD of mechatronics engineering",
      "patterns": ["who is HoD of mechatronics engineering department in air university?", "HoD of mechatronics engineering"
            
                    ],
      "responses": [
        "Dr. Noman Naseer is HOD of mechatronics engineering department in air university."
        
      ]
    },
    {   
       "tag": "HoD of biomedical engineering",
      "patterns": ["Who is HoD of biomedical engineering department in air university?", "HoD of biomedical engineering"
            
                    ],
      "responses": [
        "Dr. Eng. Zia Mohy Ud Din is HOD of biomedical engineering department in air university."       
      ]
},
{
       "tag": "courses are taught or offered in electrical engineering",
      "patterns": ["Which courses are taught or offered in electrical engineering department?", "courses are taught or offered in electrical engineering"
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in computer engineering",
      "patterns": ["Which courses are taught or offered in computer engineering department?", "courses are taught or offered in computer engineering"
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in mechatronics engineering",
      "patterns": ["Which courses are taught or offered in mechatronics engineering department?", "courses are taught or offered in mechatronics engineering"
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in biomedical engineering",
      "patterns": ["Which courses are taught or offered in biomedical engineering department?", "courses are taught or offered in biomedical engineering"
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in BS electrical engineering",
      "patterns": ["Which courses are taught or offered in BS electrical engineering in air university?", "courses are taught or offered in BS electrical engineering"
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in MS electrical engineering",
      "patterns": ["Which courses are taught or offered in MS electrical engineering in air university?", "courses are taught or offered in MS electrical engineering"
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in PhD electrical engineering",
      "patterns": ["Which courses are taught or offered in PhD electrical engineering in air university?", "courses are taught or offered in PhD electrical engineering"
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in BS computer engineering ",
      "patterns": ["Which courses are taught or offered in BS computer engineering in air university?", "courses are taught or offered in BS computer engineering"
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in MS computer engineering ",
      "patterns": ["Which courses are taught or offered in MS computer engineering in air university?", "courses are taught or offered in MS computer engineering "
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in PhD computer engineering",
      "patterns": ["Which courses are taught or offered in PhD computer engineering in air university?", "courses are taught or offered in PhD computer engineering"
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in BS mechatronics engineering",
      "patterns": ["Which courses are taught or offered in BS mechatronics engineering in air university?", "courses are taught or offered in BS mechatronics engineering"
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in MS mechatronics engineering ",
      "patterns": ["Which courses are taught or offered in MS mechatronics engineering in air university?", "courses are taught or offered in MS mechatronics engineering "
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in PhD mechatronics engineering",
      "patterns": ["Which courses are taught or offered in PhD mechatronics engineering in air university?", "courses are taught or offered in PhD mechatronics engineering "
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in BS biomedical engineering ",
      "patterns": ["Which courses are taught or offered in BS biomedical engineering in air university?", "courses are taught or offered in BS biomedical engineering "
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in MS biomedical engineering ",
      "patterns": ["Which courses are taught or offered in MS biomedical engineering in air university?", "courses are taught or offered in MS biomedical engineering "
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "courses are taught or offered in PhD biomedical engineering ",
      "patterns": ["Which courses are taught or offered in PhD biomedical engineering in air university?", "courses are taught or offered in PhD biomedical engineering "
            
                    ],
      "responses": [
        "For detailed information about the courses offered, please visit air university website."
        
      ]
},
{
       "tag": "research work being done in electrical engineering",
      "patterns": ["Is there any research work being done in electrical engineering department of air university?", "research work being done in electrical engineering"
            
                    ],
      "responses": [
        "Yes air university's electrical engineering department is conducting research and development activities."
        
      ]
},
{
       "tag": "research areas are in electrical engineering",
      "patterns": ["How many research areas are in electrical engineering department of air university?", "research areas are in electrical engineering"
            
                    ],
      "responses": [
        "Currently research work is being done in 6 areas in electrical engineering department. For more information visit air university website."
        
      ]
},
{
       "tag": "research work being done in computer engineering",
      "patterns": ["Is there any research work being done in computer engineering department of air university?", "research work being done in computer engineering"
            
                    ],
      "responses": [
        "Yes air university's computer engineering department is conducting research and development activities."
        
      ]
},
{
       "tag": "research areas are in computer engineering",
      "patterns": ["How many research areas are in computer engineering department of air university?", "research areas are in computer engineering"
            
                    ],
      "responses": [
        "Currently research work is being done in 6 areas in computer engineering department. For more information visit air university website."
        
      ]
},
{
       "tag": "research work being done in mechatronics engineering",
      "patterns": ["Is there any research work being done in mechatronics engineering department of air university?", "research work being done in mechatronics engineering"
            
                    ],
      "responses": [
        "Yes air university's mechatronics engineering department is conducting research and development activities."
        
      ]
},
{
       "tag": "research areas are in mechatronics engineering",
      "patterns": ["How many research areas are in mechatronics engineering department of air university?", "research areas are in mechatronics engineering"
            
                    ],
      "responses": [
        "Currently research work is being done in 6 areas in mechatronics engineering department. For more information visit air university website."
        
      ]
},
{
       "tag": "research work being done in biomedical engineering",
      "patterns": ["Is there any research work being done in biomedical engineering department of air university?", "research work being done in biomedical engineering "
            
                    ],
      "responses": [
        "Yes air university's biomedical engineering department is conducting research and development activities."
        
      ]
},
{
       "tag": "research areas are in biomedical engineering",
      "patterns": ["How many research areas are in biomedical engineering department of air university?", "research areas are in biomedical engineering"
            
                    ],
      "responses": [
        "Currently research work is being done in 6 areas in biomedical engineering department. For more information visit air university website."
        
      ]
},
{
       "tag": "labs in electrical engineering",
      "patterns": ["Are there any labs in electrical engineering department?", "labs in electrical engineering"
            
                    ],
      "responses": [
        "Yes there are labs in electrical engineering department. For more information visit air university website."
        
      ]
},
{
       "tag": "labs in computer engineering",
      "patterns": ["Are there any labs in computer engineering department?", "labs in computer engineering"
            
                    ],
      "responses": [
        "Yes there are labs in computer engineering department. For more information visit air university website."
        
      ]
},
{
       "tag": "labs in mechatronics engineering",
      "patterns": ["Are there any labs in mechatronics engineering department?", "labs in mechatronics engineering"
            
                    ],
      "responses": [
        "Yes there are labs in mechatronics engineering department. For more information visit air university website."
        
      ]
},
{
       "tag": "labs in biomedical engineering",
      "patterns": ["Are there any labs in biomedical engineering department?", "labs in biomedical engineering"
            
                    ],
      "responses": [
        "Yes there are labs in biomedical engineering department. For more information visit air university website."
        
      ]
},
{
       "tag": "Social Sciences?",
      "patterns": ["What are Social Sciences?", "Social Sciences?"
            
                    ],
      "responses": [
        "Social Sciences help explain the world in which we live."
        
      ]
},
{
       "tag": "Social Sciences important for academics",
      "patterns": ["Are Social Sciences important for academics?", "Social Sciences important for academics"
            
                    ],
      "responses": [
        "Social Sciences are an incumbent part of any university's basic curriculum."
        
      ]
},
{
       "tag": "faculty of Social Sciences",
      "patterns": ["Does Air University have a faculty of Social Sciences?", "faculty of Social Sciences"
            
                    ],
      "responses": [
        "Yes. Faculty of Social Sciences is one of the vibrant faculties of Air University"
        
      ]
},
{
       "tag": "dean of the department of social sciences",
      "patterns": ["Who is dean of the department of social sciences in air university?", "dean of the department of social sciences"
            
                    ],
      "responses": [
        "Prof. Dr. Munawar Iqbal Ahmad is the dean of the department of social sciences in air university."
        
      ]
},
{
       "tag": "programs are being offered in department of social sciences",
      "patterns": ["Which programs are being offered in department of social sciences of air university?", "programs are being offered in department of social sciences"            
                    ],
      "responses": [
        "Air university's department of social sciences is offering BS in English, BS in psychology, MS/MPhil in clinical psychology, Ms/Mphil education, MS /M.Phil in Linguistics, MS /M.Phil in Linguistics and Literature,PhD Linguistics and PhD Linguistics and Literature."
        
      ]
},
{
       "tag": "duration of BS English",
      "patterns": ["What is duration of BS English in air university?", "duration of BS English"
            
                    ],
      "responses": [
        "the duration of BS English in air university is 4 years."
        
      ]
},
{
       "tag": "credit hours are in BS English program",
      "patterns": ["How many credit hours are in BS English program in Air university?", "credit hours are in BS English program"
            
                    ],
      "responses": [
        "There are total 136 credit hours in BS English program in air university."
        
      ]
},
{
       "tag": "eligibility criteria of BS English program",
      "patterns": ["What is eligibility criteria of BS English program in air university?", "eligibility criteria of BS English program"
            
                    ],
      "responses": [
        "The eligibility criteria of BS English program in air university are Intermediate (12 years of education) with a minimum of 50 percent marks 3rd Division in matriculation is not acceptable."
        
      ]
},
{
       "tag": "offering MS in English",
      "patterns": ["Is air university offering MS in English?", "offering MS in English"
            
                    ],
      "responses": [
        "Yes air university is offering MS in English."
        
      ]
},
{
       "tag": "duration of MS English",
      "patterns": ["What is duration of MS English in air university?", "duration of MS English"
            
                    ],
      "responses": [
        "The duration of MS English in air university is 2 years."
        
      ]
},
{
       "tag": "credit hours are in MS English",
      "patterns": ["How many credit hours are in MS English program in Air university?", "credit hours are in MS English"
            
                    ],
      "responses": [
        "Visit air university website for more details about credit hours of MS English program."
        
      ]
},
{
       "tag": "eligibility criteria of MS English",
      "patterns": ["What is eligibility criteria of MS English program in air university?", "eligibility criteria of MS English"
            
                    ],
      "responses": [
        "Four years Bachelor Degree in English/ Linguistics/Applied Linguistics/ELT (min 45 percent marks/ CGPA 2.50/4.00). GAT-General Test (at least 50 percent score) or AU Admission Test (at least 60 percent score). And at last Interview."
        
      ]
},
{
       "tag": "offering MPhil in English",
      "patterns": ["Is air university offering MPhil in English?", "offering MPhil in English"
            
                    ],
      "responses": [
        " Yes air university is offering MPhil in English."
        
      ]
},

{
       "tag": "duration of MPhil English",
      "patterns": ["What is duration of MPhil English in air university?", "duration of MPhil English"
            
                    ],
      "responses": [
        "The duration of MPhil English in air university is 2 years."
        
      ]
},
{
       "tag": "credit hours are in MPhil English",
      "patterns": ["How many credit hours are in MPhil English program in Air university?", "credit hours are in MPhil English"
            
                    ],
      "responses": [
        "Visit air university website for more details about credit hours of MPhil English program."
        
      ]
},
{
       "tag": "eligibility criteria of MPhil English",
      "patterns": ["What is eligibility criteria of MPhil English program in air university?", "eligibility criteria of MPhil English"
            
                    ],
      "responses": [
        "Masters in English/Linguistics/Applied Linguistics/ELT or Four years Bachelor Degree in English/ Linguistics/Applied Linguistics/ELT (min 45 percent marks/ CGPA 2.50/4.00). GAT-General Test (at least 50 percent score) or AU Admission Test (at least 60 percent score). And at last Interview."
        
      ]
},
{
       "tag": "offering MS in linguistics",
      "patterns": ["Is air university offering MS in linguistics?", "offering MS in linguistics"
            
                    ],
      "responses": [
        " Yes air university is offering MS in linguistics."
        
      ]
},
{
       "tag": "duration of MS linguistics",
      "patterns": ["what is duration of MS linguistics in air university?", "duration of MS linguistics"
            
                    ],
      "responses": [
        "The duration of MS linguistics in air university is 2 years."
        
      ]
},

{	
      "tag": "admission",
      "patterns": ["I need a help regarding questions related to the admission",
                   "I need a help regarding the admission process of air university",
                   "I need a help regarding the admission process",
                   "I need a help regarding questions related to the admission",
                   "admission"
                    ],
      "responses": [
      "Yes, Sure. I would love to help you. What are your questions"	
      ]	
    },
{
      "tag": "basic and applied sciences",
      "patterns": ["Is there faculty of basic and applied sciences in Air university?",
                    "Is there faculty of applied sciences in Air university?",
                    "Is there faculty of basic sciences in Air university?",
                    "basic and applied sciences",
                    "basic sciences",
                    "applied sciences sciences"],
      "responses": [
        "Yes air university has faculty of basic and applied sciences , under which BS physics and BS mathematics programs are offered"
        
      ]
    },
{
      "tag": "bs physics",
      "patterns": ["Does air university offer BS physics?",
                   "BS physics?",
                   "Is BS Physics program being offered by air university?"
                    ],
      "responses": [
        "Yes air university offers BS physics"
        
      ]
    },
{
      "tag": "physics department",
      "patterns": ["Does air university have department of physics?",
                   "physics department?",
                   "department of physics?",
                   "Does air university have physics department?"
                    ],
      "responses": [
        "Yes air university has department of physics."
        
      ]
    },
{
      "tag": "physics programs",
      "patterns": ["Which programs are offered by department of physics in air university?",
                   "physics programs",
                   "department of physics programs"
                    ],
      "responses": [
        "Air university is offering BS , MS and PhD programs in Physics department."
        
      ]
    },
{
      "tag": "ms physics",
      "patterns": ["Is air university offering MS physics?",
                   "MS physics",
                   "Is MS Physics program being offered by air university?"
                    ],
      "responses": [
        "Yes Air university is offering MS physics program."
        
      ]
    },
{
      "tag": "BE in mechatronics engineering",
      "patterns": ["Is air university offering BE in mechatronics engineering?",
                   "BE in mechatronics engineering",
                   "BE mechatronics engineering?"
                    ],
      "responses": [
        "Yes air university is offering BE in mechatronics engineering."
        
      ]
    },
{
      "tag": "Bachelors in mechatronics engineering",
      "patterns": ["Is air university offering Bachelors in mechatronics engineering?",
                   "Bachelors in mechatronics engineering",
                   "Bachelors mechatronics engineering"
                    ],
      "responses": [
        "Yes air university is offering Bachelors in mechatronics engineering."
        
      ]
    },
{
      "tag": "credit hours of Bachelors in mechatronics engineering",
      "patterns": ["How many credit hours are in BS mechatronics engineering in air university?",
                   "credit hours in BS mechatronics engineering",
                   "credit hours Bachelors mechatronics engineering"
                    ],
      "responses": [
        "There are total 153 in BS mechatronics engineering."
        
      ]
    },
{
      "tag": "eligibility criteria for Bachelors in mechatronics engineering",
      "patterns": ["What is eligibility criteria for BS mechatronics engineering in air university?",
                   "eligibility criteria for BS mechatronics engineering",
                   "eligibility criteria for Bachelors in mechatronics engineering"
                    ],
      "responses": [
        "F.Sc Pre Engineering or Equivalent Physics, Chemistry, Math. Minimum 60 percent marks."
        
      ]
    },
{
      "tag": "MS in mechatronics engineering",
      "patterns": ["Is air university offering MS in mechatronics engineering?",
                   "MS in mechatronics engineering",
                   "masters in mechatronics engineering"
                    ],
      "responses": [
        "Yes air university is offering MS in mechatronics engineering."  
        
      ]
    },
{
      "tag": "masters in mechatronics engineering",
      "patterns": ["Is air university offering masters in mechatronics engineering?",
                   "masters in mechatronics engineering",
                   "MS in mechatronics engineering",                   
                   "masters in mechatronics engineering in air university"
                    ],
      "responses": [
        "yes air university is offering masters in mechatronics engineering."

        
      ]
    },
{
      "tag": "duration of MS in mechatronics engineering in air university",
      "patterns": ["what is the duration of MS in mechatronics engineering in air university?",
                   "duration of MS in mechatronics engineering",
                   "duration of masters in mechatronics engineering",                   
                   "duration of MS in mechatronics engineering in air university"
                    ],
      "responses": [
        "the duration of MS mechatronics engineering in air university is 2 years."

        
      ]
    },
{
      "tag": "credit hours are in MS mechatronics engineering in air university",
      "patterns": ["How many credit hours are in MS mechatronics engineering in air university?",
                   "credit hours in masters mechatronics engineering in air university",
                   "credit hours in MS mechatronics engineering"
                    ],
      "responses": [
        "There are total 30 in MS mechatronics engineering."     

        
      ]
    },
{
      "tag": "eligibility criteria for MS mechatronics engineering in air university",
      "patterns": ["What is eligibility criteria for MS mechatronics engineering in air university?",
                   "eligibility criteria for masters mechatronics engineering in air university",
                   "eligibility criteria for MS mechatronics engineering"
                    ],
      "responses": [
        "B.E/B.Sc Engg (Mechanical, Electrical, Mechatronics) minimum CGPA 2.5 and Interview."        

        
      ]
    },
{
      "tag": "MS in mechatronics engineering",
      "patterns": ["is air university offering MS in mechatronics engineering?",
                   "MS in mechatronics engineering from air university",
                   "Masters in mechatronics engineering from air university"
                    ],
      "responses": [
        "Yes air university is offering MS in mechatronics engineering."                

        
      ]
    },
{
      "tag": "PhD in mechatronics engineering",
      "patterns": ["Is air university offering PhD in mechatronics engineering?",
                   "PhD in mechatronics engineering from air university",
                   "PhD in mechatronics engineering"
                    ],
      "responses": [
        "Yes air university is offering PhD in mechatronics engineering." 

        
      ]
    },
{
      "tag": "doctorate in mechatronics engineering",
      "patterns": ["Is air university offering doctorate in mechatronics engineering?",
                   "doctorate in mechatronics engineering from air university",
                   "doctorate in mechatronics engineering"
                    ],
      "responses": [
        "Yes air university is offering doctorate in mechatronics engineering."  

        
      ]
    },
{
      "tag": "duration of PhD in mechatronics engineering in air university",
      "patterns": ["what is the duration of PhD in mechatronics engineering in air university?",
                   "duration of PhD in mechatronics engineering in air university",
                   "Time taken to complete PhD in mechatronics engineering in air university "
                    ],
      "responses": [
        "the duration of MS mechatronics engineering in air university is maximum 4 years."  

        
      ]
    },
{
      "tag": "credit hours are in PhD mechatronics engineering in air university",
      "patterns": ["How many credit hours are in PhD mechatronics engineering in air university?",
                   "credit hours in PhD mechatronics engineering in air university",
                   "credit hours in PhD mechatronics engineering"
                    ],
      "responses": [
        "48 (18 Credit Hours of Course work, 30 Credit Hours of dissertation work)."         

        
      ]
    },
{
      "tag": "eligibility criteria for MS mechatronics engineering in air university",
      "patterns": ["What is eligibility criteria for MS mechatronics engineering in air university?",
                   "eligibility criteria for MS mechatronics engineering in air university",
                   "eligibility criteria for MS mechatronics engineering"
                    ],
      "responses": [
        "Masters/ M Phil degree in relevant area with a minimum 300/400 or equivalent Passing GRE (subject) or GAT(subject) by NTS with at least 60 percent mark."     

        
      ]
    },
{
      "tag": "areas in which PhD is being offered in mechatronics",
      "patterns": ["In which areas PhD is being offered in mechatronics?",
                   "areas PhD is being offered in mechatronics in air university",
                   "in which areas PhD is being offered in mechatronics in air university"
                    ],
      "responses": [
        "Air university is offering PhD mechatronics in Robotics and control Industrial automation, Micro-Electro-Mechanical Systems (MEMs), Renewable energy."             

        
      ]
    },
{
      "tag": "department of mechatronics engineering in air university",
      "patterns": ["Does air university has department of mechatronics engineering?",
                   "department of mechatronics engineering in air university",
                   "mechatronics department engineering in air university"
                    ],
      "responses": [
        "Yes air university has department of mechatronics."                     

        
      ]
    },
{
      "tag": "department of electrical engineering in air university",
      "patterns": ["Does air university has department of electrical engineering?",
                   "department of electrical engineering in air university",
                   "electrical engineering department in air university"
                    ],
      "responses": [
        "Yes air university has department of electrical engineering."     

        
      ]
    },
{
      "tag": "BS in biomedical engineering in air university",
      "patterns": ["Is air university offering BS in biomedical engineering?",
                   "BS in biomedical engineering in air university",
                   "air university offering bachleros in biomedical engineering"
                    ],
      "responses": [
        "Yes air university is offering BS in biomedical engineering."       

        
      ]
    },
{
      "tag": "bachelors in biomedical engineering in air university",
      "patterns": ["Is air university offering bachelors in biomedical engineering?",
                   "bachelors in biomedical engineering in air university",
                   "air university offering bachelors in biomedical engineering"
                    ],
      "responses": [
        "Yes air university is offering bachelors in biomedical engineering."            

        
      ]
    },
{
      "tag": "duration of BE in biomedical engineering in air university",
      "patterns": ["what is the duration of BE in biomedical engineering in air university?",
                   "duration of BE in biomedical engineering in air university",
                   "BE in biomedical engineering duration in air university"
                    ],
      "responses": [
        "The duration of BE biomedical engineering in air university is 4 years."        

        
      ]
    },
{
      "tag": "credit hours of BE in biomedical engineering in air university",
      "patterns": ["How many credit hours are in BE biomedical engineering in air university?",
                   "credit hours of BE in biomedical engineering in air university",
                   "BE in biomedical engineering credit hours in air university"
                    ],
      "responses": [
        "There are total 137 credit hours in BE biomedical engineering in air university."               

        
      ]
    },
{
      "tag": "eligibility criteria for BE in biomedical engineering in air university",
      "patterns": ["What is eligibility criteria for BE biomedical engineering in air university?",
                   "eligibility criteria for BE in biomedical engineering in air university",
                   "BE in biomedical engineering eligibility criteria in air university"
                    ],
      "responses": [
        "F.Sc Pre Engineering/ Pre Medical or Equivalent Physics, Chemistry, Math/ Biology. Minimum 60 percent Marks." 

        
      ]
    },
{
      "tag": "areas in which BE is being offered in biomedical engineering",
      "patterns": ["In which areas BE is being offered in biomedical engineering?",
                   "areas in which BE is being offered in biomedical engineering in air university",
                   "BE in biomedical engineering areas in air university"
                    ],
      "responses": [
        "Please visit air university website for details."         

        
      ]
    },
{
      "tag": "department of biomedical engineering in air university",
      "patterns": ["Does air university has department of biomedical engineering?",
                   "department of biomedical engineering in air university",
                   "biomedical engineering department in air university"
                    ],
      "responses": [
        "Yes air university has department of biomedical engineering."         

        
      ]
    },
{
      "tag": "MS in biomedical engineering in air university",
      "patterns": ["Is air university offering MS in biomedical engineering?",
                   "MS in biomedical engineering in air university",
                   "Masters in biomedical engineering in air university"
                    ],
      "responses": [
        "yes air university is offering MS in biomedical engineering." 

        
      ]
    },
{
      "tag": "masters in biomedical engineering in air university",
      "patterns": ["Is air university offering masters in biomedical engineering?",
                   "masters in biomedical engineering in air university",
                   "MS in biomedical engineering in air university"
                    ],
      "responses": [
        "yes air university is offering masters in biomedical engineering."      

        
      ]
    },
{
      "tag": "duration of MS in biomedical engineering in air university",
      "patterns": ["what is the duration of MS in biomedical engineering in air university?",
                   "MS in biomedical engineering duration in air university",
                   "duration of MS biomedical engineering in air university"
                    ],
      "responses": [
        "the duration of MS biomedical engineering in air university is 2 years."            

        
      ]
    },
{
      "tag": "credit hours of MS in biomedical engineering in air university",
      "patterns": ["How many credit hours are in MS biomedical engineering in air university??",
                   "credit hours of MS in biomedical engineering in air university",
                   "MS in biomedical engineering credit hours in air university"
                    ],
      "responses": [
        "there are total 31 credit hours in MS biomedical engineering in air university."  

        
      ]
    },
{
      "tag": "eligibility criteria for MS in biomedical engineering in air university",
      "patterns": ["What is eligibility criteria for MS biomedical engineering in air university?",
                   "eligibility criteria for MS in biomedical engineering in air university",
                   "MS in biomedical engineering eligibility criteria in air university"
                    ],
      "responses": [
        "Four years Bachelor/ Equivalent in engineering disciplines accredited by the Pakistan Engineering Council. With at least 124 Credit hours beyond 12 years of schooling, with a CGPA of at least 2.00 (on the scale of 4.00) OR Equivalent i.e. First Division under annual system. For further details visit AU website."  

        
      ]
    },
{
      "tag": "areas in which MS is being offered in biomedical engineering",
      "patterns": ["In which areas MS is being offered in biomedical engineering?",
                   "areas in which MS is being offered in biomedical engineering in air university",
                   "MS in biomedical engineering areas in air university"
                    ],
      "responses": [
        "Please visit air university website for details."

        
      ]
    },
{
      "tag": "PhD in biomedical engineering from air university",
      "patterns": ["Is air university offering PhD in biomedical engineering?",
                   "PhD in biomedical engineering from air university",
                   "PhD in biomedical engineering"
                    ],
      "responses": [
        "No air university is not offering PhD in biomedical engineering." 

        
      ]
    },
{
      "tag": "doctorate in biomedical engineering from air university",
      "patterns": ["Is air university offering doctorate in biomedical engineering?",
                   "doctorate in biomedical engineering from air university",
                   "doctorate in biomedical engineering"
                    ],
      "responses": [
        "No air university is not offering doctorate in biomedical engineering."         

        
      ]
    },
{
      "tag": "faculty members in biomedical engineering department of air university",
      "patterns": ["How many faculty members are in biomedical engineering department?",
                   "faculty members in biomedical engineering department",
                   "faculty members in biomedical engineering"
                    ],
      "responses": [
        "There are 9 faculty members in biomedical engineering department."   

        
      ]
    },
{
      "tag": "doctorates in biomedical engineering department of air university",
      "patterns": ["How many doctorates are in biomedical engineering department?",
                   "doctorates in biomedical engineering department",
                   "doctorates in biomedical engineering"
                    ],
      "responses": [
        "There are 2 doctorates in biomedical engineering department."   

        
      ]
    },
{
      "tag": "lab engineers in biomedical engineering department of air university",
      "patterns": ["How many lab engineers are in biomedical engineering department?",
                   "lab engineers in biomedical engineering department",
                   "lab engineers in biomedical engineering"
                    ],
      "responses": [
        "There are 2 lab engineers in biomedical engineering department. Usually the course lecturer his self takes the lab of that course." 

        
      ]
    },
{
      "tag": "lecturers in biomedical engineering department of air university",
      "patterns": ["How many lecturers are in biomedical engineering department?",
                   "lecturers in biomedical engineering department",
                   "lecturers in biomedical engineering"
                    ],
      "responses": [
        "There are 4 lecturers and 3 assistant professors in biomedical engineering department."  

        
      ]
    },
{
      "tag": "faculty members in mechatronics engineering department of air university",
      "patterns": ["How many faculty members are in mechatronics engineering department?",
                   "faculty members in mechatronics engineering department",
                   "faculty members in mechatronics engineering"
                    ],
      "responses": [
        "There are 28 faculty members in mechatronics engineering department."

        
      ]
    },
{
      "tag": "doctorates in mechatronics engineering department of air university",
      "patterns": ["How many doctorates are in mechatronics engineering department?",
                   "doctorates in mechatronics engineering department",
                   "doctorates in mechatronics engineering"
                    ],
      "responses": [
        "There are 7 doctorates in mechatronics engineering department."  

        
      ]
    },
{
      "tag": "lab engineers in mechatronics engineering department of air university",
      "patterns": ["How many lab engineers are in mechatronics engineering department?",
                   "lab engineers in mechatronics engineering department",
                   "lab engineers in mechatronics engineering"
                    ],
      "responses": [
        "There are 4 lab engineers in mechatronics engineering department. Usually the course lecturer his self takes the lab of that course."        

        
      ]
    },
{
      "tag": "lecturers in mechatronics engineering department of air university",
      "patterns": ["How many lecturers are in mechatronics engineering department?",
                   "lecturers in mechatronics engineering department",
                   "lecturers in mechatronics engineering"
                    ],
      "responses": [
        "There are 8 lecturers and 9 assistant professors and 5 research assistants in mechatronics engineering department."  

        
      ]
    },
{
      "tag": "faculty members in electrical engineering department of air university",
      "patterns": ["How many faculty members are in electrical engineering department?",
                   "faculty members in electrical engineering department",
                   "faculty members in electrical engineering"
                    ],
      "responses": [
        "There are 62 faculty members in electrical engineering department."       

        
      ]
    },
{
      "tag": "doctorates in electrical engineering department of air university",
      "patterns": ["How many doctorates are in electrical engineering department?",
                   "doctorates in electrical engineering department",
                   "doctorates in electrical engineering"
                    ],
      "responses": [
        "There are 21 doctorates in electrical engineering department."    

        
      ]
    },
{
      "tag": "lab engineers in electrical engineering department of air university",
      "patterns": ["How many lab engineers are in electrical engineering department?",
                   "lab engineers in electrical engineering department",
                   "lab engineers in electrical engineering"
                    ],
      "responses": [
        "There are 14 lab engineers in electrical engineering department. Usually the course lecturer his self takes the lab of that course."

        
      ]
    },
{
      "tag": "lecturers in electrical engineering department of air university",
      "patterns": ["How many lecturers are in electrical engineering department?",
                   "lecturers in electrical engineering department",
                   "lecturers in electrical engineering"
                    ],
      "responses": [
        "There are 18 lecturers ,25 assistant professors and 4 research assistants in electrical engineering department." 

        
      ]
    },
{
      "tag": "faculty members in computer engineering department of air university",
      "patterns": ["How many faculty members are in computer engineering department?",
                   "faculty members in computer engineering department",
                   "faculty members in computer engineering"
                    ],
      "responses": [
        "There are 62 faculty members in computer engineering department."  

        
      ]
    },
{
      "tag": "doctorates in computer engineering department of air university",
      "patterns": ["How many doctorates are in computer engineering department?",
                   "doctorates in computer engineering department",
                   "doctorates in computer engineering"
                    ],
      "responses": [
        "There are 21 doctorates in computer engineering department."      

        
      ]
    },
{
      "tag": "lab engineers in computer engineering department of air university",
      "patterns": ["How many lab engineers are in computer engineering department?",
                   "lab engineers in computer engineering department",
                   "lab engineers in computer engineering"
                    ],
      "responses": [
        "There are 14 lab engineers in computer engineering department. Usually the course lecturer his self takes the lab of that course."

        
      ]
    },
{
      "tag": "lecturers in computer engineering department of air university",
      "patterns": ["How many lecturers are in computer engineering department?",
                   "lecturers in computer engineering department",
                   "lecturers in computer engineering"
                    ],
      "responses": [
        "There are 18 lecturers ,25 assistant professors and 4 research assistants in computer engineering department."

        
      ]
    },
{	
      "tag": "phd management sciences lecturers",
      "patterns": ["How many lecturers are for PhD in management sciences?",
                   "How many lecturers are for PhD in management sciences?",
                   "phd management sciences lecturers"
                    ],
      "responses": [
      "There are 8 lectures, 5 consultants and 18 associate professors for PhD in management sciences."	
      ]	
    },
{	
      "tag": "management sciences doctorates",
      "patterns": ["How many doctorates are for PhD in management sciences?",
                   "How many doctorates are for PhD in management sciences?",
                   "management sciences doctorates "
                    ],
      "responses": [
      "There are 14 doctorates for PhD in management sciences"	
      ]	
    },
{	
      "tag": "phd management sciences faculty members",
      "patterns": ["how much teaching staff is for PhD in management sciences?",
                   "how much teaching staff is for PhD in management sciences?",
                   "phd management sciences faculty members "
                    ],
      "responses": [
      "There are total 33 teachers for PhD in management sciences"	
      ]	
    },

    
{	
      "tag": "business analytics lecturers",
      "patterns": ["How many lecturers are for MS in business analytics?",
                   "business analytics lecturers"
                    ],
      "responses": [
      "There are 8 lectures, 5 consultants and 18 associate professors for MS in business analytics."	
      ]	
    },
    
{	
      "tag": "ms business analytics doctrates",
      "patterns": ["How many doctorates are for MS in business analytics?",
                   "How many doctorates are for MS in business analytics?",
                   	
" ms business analytics doctrates "
                    ],

      "responses": [
      "There are 14 doctorates for MS in business analytics."	
      ]	
    },
{	
      "tag": "business analytics teaching faculty",
      "patterns": ["How much teaching staff is for MS in business analytics?",
                   "How much teaching staff is for MS in business analytics?",
                   "business analytics"
                    ],
      "responses": [
      "there are total 33 teachers for MS in business analytics."	
      ]	
    },
{	
      "tag": "ms management sciences lecturers",
      "patterns": ["How many lecturers are for MS in management sciences?",
                   "How many lecturers are for MS in management sciences?",
                   "ms management sciences lecturers"
                    ],

      "responses": [
      "There are 8 lectures, 5 consultants and 18 associate professors for MS in management sciences."	
      ]	
    },
{	
      "tag": "ms management sciences doctorates",
      "patterns": ["How many doctorates are for MS in management sciences?",
                   "How many doctorates are for MS in management sciences?",
                   "ms management sciences doctorates"
                    ],
      "responses": [
      "There are 14 doctorates for MS in management sciences."	
      ]	
    },
    
{	
      "tag": "ms management sciences teaching staff",
      "patterns": ["how much teaching staff is for MS in management sciences?",
                   "how much teaching staff is for MS in management sciences?",
                   "ms management sciences teaching staff"
                    ],
      "responses": [
      "There are total 33 teachers for MS in management sciences."	
      ]	
    },


{	
      "tag": "ms program management lecturers",
      "patterns": ["How many lecturers are for MS in program management?",
                   "How many lecturers are for MS in program management?",
                   " ms program management lecturers "
                    ],
      "responses": [
      "There are 8 lectures, 5 consultants and 18 associate professors for MS in program management."	
      ]	
    },
{	
      "tag": "ms program management doctorates",
      "patterns": ["How many doctorates are for MS in program management?",
                   "How many doctorates are for MS in program management?",
                   " ms program management doctorates "
                    ],
      "responses": [
      "There are 14 doctorates for MS in program management."	
      ]	
    },
{	
      "tag": "ms Program management teaching staff",
      "patterns": ["how much teaching staff is for MS in program management?",
                   "how much teaching staff is for MS in program management?",
                   " ms Program management teaching staff "
                    ],
      "responses": [
      "There are total 33 teachers for MS in program management."	
      ]	
    },
{
      "tag": " credit hours in ms linguistics",
      "patterns": ["How many credit hours are in MS linguistics in Air University?",
                   " credit hours in ms linguistics",
                   "Credit hours of MS linguistics in Air University?"
                    ],
      "responses": [
        "Visit out Air University for more details about credit hours of MS linguistics"
        
      ]
    },
{
      "tag": "MS linguistics eligibility criteria",
      "patterns":["What is the eligibility criteria for MS linguistics in Air University?  ",
                   "ms linguistics eligibility criteria ",
                   "Eligibility criteria for MS linguistics in Air University?"
                    ],
      "responses": [
        "Four years Bachelor Degree in Linguistics(min 45 percent marks/ CGPA 2.50/4.00). GAT-General Test (at least 50 percent score) or AU Admission Test (at least 60 percent score)" 
      ]
    },
{
      "tag": " MPhil linguistics",
      "patterns": [" Is air university offering MPhil in linguistics?",
                   " MPhil linguistics",
                   " Is air university offering MPhil in linguistics? "
                    ],
      "responses": [
        "yes air university is offering MPhil in linguistics  "
        
      ]
    },


 
{
      "tag": "ms linguistics duration",
      "patterns": ["What is duration of MPhil linguistics in air university? ",
                   "ms linguistics duration",
                   "What is duration of MPhil linguistics in air university? "
                    ],
      "responses": [
        "The duration of MPhil linguistics in air university is 2 years."
        
      ]
    },
{	
      "tag": " MS business administration doctorates",
      "patterns": ["How many doctorates are for MS in business administration?",
                   "How many doctorates are for MS in business administration?",
                   	

" MS business administration doctorates "
                    ],
      "responses": [
      "There are 14 doctorates for MS in business administration."	
      ]	
    },


    
{	
      "tag": "MS business administration lecturers ",
      "patterns": ["How many lecturers are for MS in business administration?",
                   "How many lecturers are for MBA?",
                   "How many lecturers are for MS in business administration?",
                   " MS business administration lecturers "
                    ],
      "responses": [
      "There are 8 lectures, 5 consultants and 18 associate professors for MS in business administration."	
      ]	
    },
{	
      "tag": " MS business administration teaching faculty ",
      "patterns": ["how much teaching staff is for MS in business administration?",
                   "how much teaching staff is for MS in business administration?",
                   " MS business administration teaching faculty "
                    ],
      "responses": [
      "There are total 33 teachers for MS in business administration."
      ]	
    },
{	
      "tag": " tourism and hospitality management lecturers",
      "patterns": ["How many lecturers are in department of tourism and hospitality management?",
                   "How many lecturers are in department of tourism and hospitality management?",
                   " tourism and hospitality management lecturers "
                    ],
      "responses": [
      "There are 8 lectures, 5 consultants and 18 associate professors in department of tourism and hospitality management."	
      ]	
    },
{	
      "tag": " tourism and hospitality management doctorates",
      "patterns": ["How many doctorates are in department of tourism and hospitality management?",
                   "How many doctorates are in department of tourism and hospitality management?",
                   " tourism and hospitality management doctorates "
                    ],
      "responses": [
      "there are 14 doctorates in department of tourism and hospitality management."	
      ]	
    },
{	
      "tag": "BS tourism and hospitality management teaching staff",
      "patterns": ["how much teaching staff is for BS in tourism and hospitality management?",
                   "how much teaching staff is for BS in tourism and hospitality management?",
                   " BS tourism and hospitality management teaching staff "
                    ],
      "responses": [
      "there are total 33 teachers for BS in tourism and hospitality management."	
      ]	
    },
{	
      "tag": " health care management lecturers",
      "patterns": ["How many lecturers are in department of health care management?",
                   "How many lecturers are in department of health care management?",
                   " health care management lecturers "
                    ],
      "responses": [
      "There are 8 lectures, 5 consultants and 18 associate professors in department of health care management."	
      ]	
    },
{	
      "tag": " health care management doctorates",
      "patterns": ["How many doctorates are in department of health care management?",
                   "How many doctorates are in department of health care management?",
                   " health care management doctorates "
                    ],
      "responses": [
      "There are 14 doctorates in department of health care management."	
      ]	
    },
{	
      "tag": " health care management teaching staff",
      "patterns": ["How much teaching staff is for BS in health care management?",
                   "How much teaching staff is for BS in health care management?",
                   " health care management teaching staff "
                    ],
      "responses": [
      "There are total 33 teachers for BS in health care management."	
      ]	
    },

{	
      "tag": " aviation management lecturers ",
      "patterns": ["How many lecturers are in department of aviation management?",
                   "How many lecturers are in department of aviation management?",
                   " aviation management lecturers "
                    ],
      "responses": [
      "There are 8 lectures, 5 consultants and 18 associate professors in department of aviation management."	
      ]	
    },
{	
      "tag": " aviation management doctorates ",
      "patterns": ["How many doctorates are in department of aviation management?",
                   "How many doctorates are in department of aviation management?",
                   " aviation management doctorates "
                    ],
      "responses": [
      "There are 14 doctorates in department of aviation management."	
      ]	
    },
    
{	
      "tag": " bs aviation management teaching staff",
      "patterns": ["How much teaching staff is for BS in aviation management?",
                   "How much teaching staff is for BS in aviation management?",
                   " bs aviation management teaching staff "
                    ],
      "responses": [
      "There are total 33 teachers for BS in aviation management."	
      ]
},	
   
{	
      "tag": " accounting and finance lecturers",
      "patterns": ["How many lecturers are in department of accounting and finance?",
                   "How many lecturers are in department of accounting and finance?",
                   " accounting and finance lecturers "
                    ],
      "responses": [
      "there are 8 lectures, 5 consultants and 18 associate professors in department of accounting and finance."	
      ]	
    },
{	
      "tag": " accounting and finance doctorates",
      "patterns": ["How many doctorates are in department of accounting and finance?",
                   "How many doctorates are in department of accounting and finance?",
                   	

" accounting and finance doctorates "
                    ],
      "responses": [
      "There are 14 doctorates in department of accounting and finance."	
      ]	
    },
    
    
{	
      "tag": "bs accounting and finance teaching staff",
      "patterns": ["how much teaching staff is for BS in accounting and finance?",
                   "how much teaching staff is for BS in accounting and finance?",
                   " bs accounting and finance teaching staff "
                    ],
      "responses": [
      "There are total 33 teachers for BS in accounting and finance."	
      ]	
    },
{	
      "tag": " business administration lecturers",
      "patterns": ["How many lecturers are in department of business administration?",
                   "How many lecturers are in BBA department?",
                   " business administration lecturers "
                    ],
      "responses": [
      "there are 8 lectures, 5 consultants and 18 associate professors in department of business administration."	
      ]	
    },
{	
      "tag": " business administration doctorates",
      "patterns": ["How many doctorates are in department of business administration BBA?",
                   "How many doctorates are in department of business administration BBA?",
                   " business administration doctorates "
                    ],
      "responses": [
      "there are 14 doctorates in department of business administration."	
      ]	
    },
    
{	
      "tag": "bs business administration teaching staff",
      "patterns": ["how much teaching staff is for BS in business administration?",
                   "how much teaching staff is for BS in business administration?",
                   " bs business administration teaching staff "
                   ],
      "responses": [
      "there are total 33 teachers for BS in business administration."
      ]	
    },
{	
       "tag" : "management sciences lecturers",
      "patterns": ["How many lecturers are in department of management sciences?",
                   "How many lecturers are in department of management sciences?",
                   " management sciences lecturers "
                    ],
      "responses": [
      "there are 8 lectures, 5 consultants and 18 associate professors in department of management sciences."
      ]	
    },
{	
      "tag": "management sciences doctorates",
      "patterns": ["How many doctorates are in department of management sciences?",
                   "How many doctorates are in department of management sciences?",
                   "management sciences doctorates "
                    ],
      "responses": [
      "there are 14 doctorates in department of management sciences."	
      ]	
    },
{	
      "tag": "Phd management sciences teaching staff",
      "patterns": ["How much teaching staff is in department of management sciences?",
                   "How much teaching staff is in department of management sciences?",
                   " Phd management sciences teaching staff "
                    ],
      "responses": [
      "There are total 33 teachers in department of management sciences."	
      ]	
    },
    
{	
      "tag": "management sciences HOD",
      "patterns": ["Who is head of the department of management sciences in air university?",
                   "Who is head of the department of management sciences in air university?",
                   " management sciences HOD "
                    ],
      "responses": [
      "Dr. Mueen Aizaz Zafar is head of the department of management sciences in air university."	
      ]	
    },
{	
      "tag": "Phd management sciences courses",
      "patterns": ["Which courses are offered in PhD in management sciences in air university?",
                   "Which courses are offered in PhD in management sciences in air university?",
                   " Phd management sciences courses "
                    ],
      "responses": [
      "For detailed information about the courses offered, please visit air university website."	
      ]	
    },
    
{	
      "tag": " MS business analytics courses",
      "patterns": ["Which courses are offered in MS in business analytics in air university?",
                   "Which courses are offered in MS in business analytics in air university?",
                   " MS business analytics courses "
                    ],
      "responses": [
      "For detailed information about the courses offered, please visit air university website."	
      ]	
    },
{	
      "tag": "Project management courses",
      "patterns": ["Which courses are offered in project management  in air university?",
                   "Which courses are offered in project management in air university?",
                   "Project management couses"
                    ],
      "responses": [
      "For detailed information about the courses offered, please visit air university website."	
      ]	
    },

{
      "tag": "ms linguistics",
      "patterns": ["Is air university offering MS/MPhil in linguistics?",
                   "ms linguistics",
                   " Is air university offering MS/MPhil in linguistics?",
                   "ms linguistics "
                    ],
      "responses": [
        " yes air university is offering MS/MPhil in linguistics. "
        
      ]
    },
    
{	
      "tag": "ms literature",
      "patterns": ["Is air university offering MS in linguistics and literature?",
                   "Is air university offering MS in linguistics and literature?",
                   "ms literature "
                    ],
      "responses": [
        "Yes air university is offering MS in literature and linguistics"
        	
      ]
    },
{	
      "tag": "mphil literature duration",
      "patterns": ["What is the duration of MS linguistics and literature in air university?",
                   "what is duration of MS linguistics and literature in air university?",
                   "ms literature duration ",
                   "mphil literature duration "

                    ],
      "responses": [
        "The duration of this program is of 2 years"
        	
      ]
    },
{
      "tag": "MPhil linguistics credit hours",
      "patterns": ["How many credit hours are in MPhil linguistics program in Air university?",
                   "MPhil linguistics credit hours",
                   "How many credit hours are in MPhil linguistics program in Air university?"
                    ],
      "responses": [
        "Visit air university website for more details about credit hours of MPhil linguistics program "
        
      ]
    },

{
      "tag": "MPhil linguistics eligibility criteria",
      "patterns": ["And at last Interview.,What is eligibility criteria of MPhil linguistics program in air university?",
                   "MPhil linguistics eligibility criteria",
                   "And at last Interview.,What is eligibility criteria of MPhil linguistics program in air university?"
                    ],
      "responses": [
        "Masters in English/Linguistics/Applied Linguistics/ELT or Four years Bachelor Degree in English/ Linguistics/Applied Linguistics/ELT (min 45 percent marks/ CGPA 2.50/4.00)."
        
      ]
    },

{
      "tag": "ms/MPhil linguistics duration",
      "patterns": ["what is duration of MS/MPhil linguistics in air university?",
                   "what is duration of MS/MPhil linguistics in air university?",
                   "ms/MPhil linguistics duration"
                    ],
      "responses": [
        "the duration of MS/MPhil linguistics in air university is 2 years."
        
      ]
    },
{
      "tag": "ms/mphil linguistics credit hours",
      "patterns": ["How many credit hours are in MS/MPhil linguistics program in Air university?",
                   " How many credit hours are in MS/MPhil linguistics program in Air university?",
                   "ms/mphil linguistics credit hours"
                    ],
      "responses": [
        " Visit air university website for more details about credit hours of MS/MPhil linguistics program."
        
      ]
    },
{
      "tag": "ms/ mphil linguistics eligibility criteria",
      "patterns": ["What is eligibility criteria of MS/ MPhil linguistics program in air university?",
                   " What is eligibility criteria of MS/ MPhil linguistics program in air university?",
                   "ms/ mphil linguistics eligibility criteria"
                    ],
      "responses": [
        " masters in English/Linguistics/Applied Linguistics/ELT or Four years Bachelor Degree in English/ Linguistics/Applied Linguistics/ELT (min 45 percent marks/ CGPA 2.50/4.00) "
        
      ]
    },
{
      "tag": "ms/mphil literature duration",
      "patterns": ["What is duration of MS/MPhil literature in air university?",
                   "What is duration of MS/MPhil literature in air university?",
                   "ms/mphil literature duration"
                    ],
      "responses": [
        "The duration of MS/MPhil literature in air university is 2 years"
        
      ]
    },

{
      "tag": "ms/mphil literature",
      "patterns": ["literature.,Is air university offering MS/MPhil in literature?",
                   "literature.,Is air university offering MS/MPhil in literature?",        
                   "ms/mphil literature"
                    ],
      "responses": [
        "yes Air University is offering MS literature."
        
      ]
    },
{
      "tag": "ms/mphil literature credit hours",
      "patterns": ["How many credit hours are in MS/MPhil literature program in Air university?",
                   "How many credit hours are in MS/MPhil literature program in Air university?",
                   "ms/mphil literature credit hours"
                    ],
      "responses": [
        "visit air university website for more details about credit hours of MS/MPhil literature"
        
      ]
    },
{
      "tag": "ms/ mphil literature eligibility criteria",
      "patterns": ["What is eligibility criteria of MS/ MPhil literature program in air university??",
                   "What is eligibility criteria of MS/ MPhil literature program in air university?",
                   "ms/ mphil literature eligibility criteria"
                    ],
      "responses": [
        "Masters in English/Linguistics/Applied Linguistics/ELT or Four years Bachelor Degree in English/ Linguistics/Applied Linguistics/ELT (min 45 percent marks/ CGPA 2.50/4.00)GAT-General Test (at least 50% score)"
        
      ]
    },
{
      "tag": "ms literature",
      "patterns": ["Is air university offering MS in literature?",
                   "Is air university offering MS in literature?",
                   "ms literature "
                    ],
      "responses": [
        "Yes Air University is offering MS Literature"
        
      ]
    },

    
{
      "tag": "ms literature duration",
      "patterns": ["what is duration of MS literature in air university?",
                   "what is duration of MS literature in air university?",
                   "ms literature duration"
                    ],
      "responses": [
        "The duration of MS literature is 2 years"
        
      ]
    },
{
      "tag": "ms literature credit hours",
      "patterns": ["How many credit hours are in MS literature program in Air university?",
                   "How many credit hours are in MS literature program in Air university?",
                   "ms literature credit hours"
                    ],
      "responses": [
        "Visit Air University for getting more information about this program"
        	
      ]
    },
{
      "tag": "ms literature eligibility criteria",
      "patterns": ["What is the eligibility criteria for MS literature ?",
                   "What is the eligibility criteria for MS literature?",
                   "ms literature eligibility criteria"
                    ],
      "responses": [
        "Four years Bachelor Degree in English/ Linguistics/Applied Linguistics/ELT (min 45 percent marks/ CGPA 2.50/4.00)GAT-General Test (at least 50% score) or AU Admission"
        	
      ]
    },
{
      "tag": "mphil literature",
      "patterns": ["Is air university offering MPhil in literature?",
                   "Is air university offering MPhil in literature?",                   
                   "mphil literature "
                    ],
      "responses": [
        "Yes Air University is offering MS literature"
        	
      ]
    },
{
      "tag": "mphil literature duration",
      "patterns": ["what is duration of MPhil literature in air university?",
                   "what is duration of MPhil literature in air university?",
                   "mphil literature duration"
                    ],
      "responses": [
        "the duration is of 2 years"
        	
      ]
    },




{
      "tag": "mphil literature credit hours",
      "patterns": ["How many credit hours are there for MPhil literature in air university?",
                   "how many credit hours are there for MPhil literature in air university?",
                   "mphil literature credit hours"
                    ],
      "responses": [
        "Visit our university for such information "
        	
      ]
    },
  


    
{
      "tag": "mphil literature eligibility criteria",
      "patterns": ["what is the eligibility criteria for MPhil literature in air university?",
                   "what is the eligibility criteria for MPhil literature in air university?",
                   "mphil literature eligibility criteria"
                    ],
      "responses": [
        "Masters in English/Linguistics/Applied Linguistics/ELT or Four years Bachelor Degree in English/ Linguistics/Applied Linguistics/ELT (min 45 percent marks/ CGPA"
        	
      ]
    },
  
    
{
      "tag": "ms/mphil linguistics and literature",
      "patterns": ["Is air university offering MS/MPhil in linguistics and literature?",
                   "Is air university offering MS/MPhil in linguistics and literature? ?",
                   "ms/mphil linguistics and literature"
                    ],
      "responses": [
        "Yes Air University is offering MS/MPHIL in linguistics"
        	
      ]
    },
  

 
{	
      "tag": "ms/mphil literature and literature duration",
      "patterns": ["What is the duration of MS/Mphil literature and linguistics in Air Univeristy?",
                   "What is the duration of MS/Mphil literature and linguistics in Air Univeristy?",
                   "ms/mphil literature and literature duration"
                    ],
      "responses": [
        "Visit air university for such information"
        	
      ]
    },
  

{	
      "tag": "MS/MPhil linguistics and literature credit hours",
      "patterns": ["How many credit hours are in MS/MPhil linguistics and literature? ",
                   "How many credit hours are in MS/MPhil linguistics and literature?",
                   "MS/MPhil linguistics and literature credit hours"
                    ],
      "responses": [
        "Visit air university for such information"
        	
      ]
    },
  

{	
      "tag": "MS/MPhil linguistics and literature eligibility criteria",
      "patterns": ["What is the eligibility criteria for MS/Mphil in Literature and linguistics?",
                   "What is the eligibility criteria for MS/Mphil in literature and linguistics?",
                   "MS/MPhil linguistics and literature eligibility criteria"
                    ],
      "responses": [
        " Masters in English/Linguistics/Applied Linguistics/ELT or Four years Bachelor Degree in English/ Linguistics/Applied Linguistics/ELT (min 45 percent marks/ CGPA 2.50/4.00)GAT"
        	
      ]
    },

{	
      "tag": "Phd literature courses",
      "patterns": ["which courses are offered in Phd literature in Air university?",
                   "which courses are offered in Phd literature in Air university?",
                   "Phd literature courses"
                    ],
      "responses": [
        "For detailed information about the offered courses please visit Air university website"	
      ]	
    },	
  



{	
      "tag": "BS psychology courses",
      "patterns": ["which courses are offered in BS psychology in Air university?",
                   "which courses are offered in BS psychology in Air university?",
                   "BS Psychology courses"
                    ],
      "responses": [
        "For detailed information about the offered courses please visit Air university website"	
      ]	
    },	
 

{	
      "tag": "ms psychology courses",
      "patterns": ["which courses are offered in MS psychology in Air university?",
                   "which courses are offered in MS psychology in Air university?",
                   "ms Psychology courses"
                    ],
      "responses": [
        "For detailed information about the offered courses please visit Air university website"	
      ]	
    },	
  
{	
      "tag": "Phd psychology courses",
      "patterns": ["which courses are offered in Phd psychology in Air university?",
                   "which courses are offered in Phd psychology in Air university?",
                   "Phd Psychology courses"
                    ],
      "responses": [
        "For detailed information about the offered courses please visit Air university website"	
      ]	
    },	
  
{	
      "tag": "bs humanities courses",
      "patterns": ["which courses are offered in BS humanities in Air university?",
                   "which courses are offered in BS humanities in Air university?",
                   "bs humanities courses"
                    ],
      "responses": [
        "For detailed information about the offered courses please visit Air university website"	
      ]	
    },
  
{	
      "tag": "ms humanities courses",
      "patterns": ["which courses are offered in MS humanities in Air university?",
                   "which courses are offered in MS humanities in Air university?",                   	
                   "ms humanities courses"
                    ],
      "responses": [
        "For detailed information about the offered courses please visit Air university website"	
      ]	
    },
 
{	
      "tag": "mphil literature credit hours",
      "patterns": ["How many credit hours are in MS linguistics and literature program in Air university?",
                   "How many credit hours are in MS linguistics and literature program in Air university?",
                   "ms literature credit hours ",
                   "mphil literature credit hours ",
                   "ms/mphil literature credit hours "
                    ],
      "responses": [
        "visit aair university for such information"
        	
      ]
    },

{	
      "tag": "mphil literature eligibility criteria",
      "patterns": ["what is the eligibility criteria for MS linguistics and literature?",
                   "Eligibility criteria for MS literature and linguistics",
                   " ms literature eligibility criteria ",
                   " mphil literature eligibility criteria "
                    ],
      "responses": [
        "Four years Bachelor Degree in English/ Linguistics/Applied Linguistics/ELT (min 45 percent marks/ CGPA 2.50/4.00)GAT-General Test (at least 50% score) or AU Admission Test"
        	
      ]
    },
{	
      "tag": "mphil literature",
      "patterns": ["Is air university offering MPhil in linguistics and literature?",
                   "Is air university offering MS in linguistics and literature?",
                   "ms literature ",
                   "mphil literature ",
                   "ms/mphil literature "
                    ],
      "responses": [
        "yes air university is offering Mphil in linguistics and literature"
        	
      ]
    },
{	
      "tag": "mphil literature credit hours",
      "patterns": ["How many credit hours are in MPhil linguistics and literature program in Air university?",
                   "How many credit hours are in MPhil linguistics and literature program in Air university?",
                   "ms literature credit hours ",
                   "mphil literature credit hours ",
                   "ms/mphil literature credit hours "
                    ],
      "responses": [
        "Visit air university for more details about this program"
        	
      ]
    },
{	
      "tag": "mphil literature eligibility criteria",
      "patterns": ["What is eligibility criteria of MPhil linguistics and literature program in air university?",
                   "What is eligibility criteria of MPhil linguistics and literature program in air university?",
                   "mphil literature eligibility criteria "
                    ],
      "responses": [
        "Masters in English/Linguistics/Applied Linguistics/ELT or Four years Bachelor Degree in English/ Linguistics/Applied Linguistics/ELT (min 45 percent marks/ CGPA 2.50/4.00)GAT"
        	
      ]
    },
{	
      "tag": "phd literature",
      "patterns": ["Is air university offering PhD in linguistics and literature? ",
                   "Is air university offering PhD in linguistics and literature?",
                   "phd literature "
                    ],
      "responses": [
        "yes air university is offering this program"
        	
      ]
    },
{
      "tag": "phd literature duration",
      "patterns": ["What is the duration of Phd literature and linguistics?",
                   "What is the duration of Phd linguistics and literature?",
                   " phd literature duration "
                    ],
      "responses": [
        "yes air university is offering this program"
        	
      ]
    },

     
    

    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison."
      ]
    }
  ]
}
